[
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/msnbcs-mccaskill-we-need-to-lower-expectations-for-walz-debate-performance/",
      "title": "MSNBC’s McCaskill: ‘We Need to Lower Expectations’ for Walz Debate Performance",
      "author": "Jeff Poor",
      "content": "Monday, during an appearance on MSNBC’s “Deadline: White House,” former Sen. Claire McCaskill (D-MO), now an MSNBC contributor, urged viewers to lower their expectations for Gov. Tim Walz’s (D-MN) performance for Tuesday’s vice-presidential debate. McCaskill said she anticipated Sen. JD Vance (R-OH) would be prepared for the debate. “Yeah, I’m just a little worried about the expectations game at this point,” she said. “I think people — yes, J.D. Vance has said some really, I think, disqualifying things about women and how he views people and their role in life. But he will be articulate and he will be prepared and he will be better than Trump was. And I think it’s really going to be a challenge for Tim Walz to be able to counter what he is going to bring, and at the same time stay really likable and relatable, and then also instill confidence in the American people that he’s the better one to be in the wings in case something were to happen to the president.” “So, I just think we need to lower expectations a little bit, because then we can all be pleasantly surprised if I’m wrong and that Tim Walz just mops the floor with him the same way Kamala Harris mopped the floor with Donald Trump,” McCaskill added. Follow Jeff Poor on X @jeff_poor",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "Claire McCaskill",
        "Deadline: White House",
        "MSNBC",
        "Nicolle Wallace",
        "expectations",
        "debate",
        "performance",
        "McCaskill",
        "Walz",
        "people",
        "Tim"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/jimmy-carter-turns-100-first-president-to-live-to-a-century/",
      "title": "Jimmy Carter Turns 100; First President to Live to a Century",
      "author": "Joel B. Pollak",
      "content": "Former President Jimmy Carter turns 100 years old on Tuesday, October 1, making him the first U.S. president to reach the century mark. The Hill noted: When James Earl Carter Jr. was born in 1924 in the small farming town of Plains, Ga., the U.S. still had 48 states. Wheaties cereal was just making its debut on grocery store shelves, President Calvin Coolidge was in office and Babe Ruth slugged his way to becoming the MLB’s American League batting champion.\n… The naval engineer-turned-peanut farmer won election to the Georgia state Senate in 1962, before triumphing in the Peach State’s gubernatorial race in 1971.\n… Carter won his Democratic presidential bid against incumbent President Gerald Ford in 1976 and entered the White House. Carter lost to Ronald Reagan in 1980 and is widely regarded as a failed president, due to economic stagnation and chaos in foreign policy, including the Iran hostage crisis that haunted his last year in office. He won the Nobel Peace Prize in 2002 for his work on the Camp David Accords of 1978, which brought peace between Israel and Egypt. He is also regarded as a disruptive former president, infamously bungling an effort to isolate North Korea during the Clinton administration, and leading efforts to demonize Israel by calling it an “apartheid” state. Carter’s wife, former First Lady Rosalynn Carter, died less than a year ago at the age of 96. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": ["Jimmy Carter", "president", "century", "Jimmy", "Carter"],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/third-lebanon-war-begins-israel-launches-ground-offensive/",
      "title": "‘Third Lebanon War’ Begins: Israel Launches Ground Offensive",
      "author": "Joel B. Pollak",
      "content": "The Third Lebanon War has officially begun, according to Israel’s Army Radio, as Israel Defense Forces (IDF) ground forces crossed into Lebanon early Tuesday morning to remove Hezbollah outposts that threaten Israeli communities. The IDF apparently crossed into Lebanon at the “finger” or “panhandle” of Israel’s Galilee region, near the town of Metula, which was Israel’s northernmost town until the capture and annexation of the Golan Heights. In a statement, the IDF said: In accordance with the decision of the political echelon, a few hours ago, the IDF began limited, localized, and targeted ground raids based on precise intelligence against Hezbollah terrorist targets and infrastructure in southern Lebanon. These targets are located in villages close to the border and pose an immediate threat to Israeli communities in northern Israel. The IDF is operating according to a methodical plan set out by the General Staff and the Northern Command which IDF soldiers have trained and prepared for in recent months. The Israeli Air Force and IDF Artillery are supporting the ground forces with precise strikes on military targets in the area. These operations were approved and carried out in accordance with the decision of the political echelon. Operation “Northern Arrows” will continue according to the situational assessment and in parallel to combat in Gaza and in other arenas. The IDF is continuing to operate to achieve the goals of the war and is doing everything necessary to defend the citizens of Israel and return the citizens of northern Israel to their homes. The ground invasion began exactly two weeks after Israel’s security cabinet decided to adopt a new war goal, namely the safe return of Israel’s northern residents to the homes from which they were evacuated when Hezbollah opened fire in October. According to Army Radio, the goal of the war is not to occupy southern Lebanon, or to establish a “security zone” (see below), but simply to remove Hezbollah bases and positions from which terrorists have been firing on Israeli citizens. The First Lebanon War took place in 1982, when Israel invaded southern Lebanon to remove Palestinian guerillas who had shelled Israeli communities. Israel won the war but went astray when it continued on to Beirut and tried to install a friendly government in Lebanon, amid civilian casualties and atrocities by local militias. While the Palestine Liberation Organization (PLO) was forced to leave Lebanon, Israelis came to regard the war as their own Vietnam. For 18 years, Israel occupied a “security zone” north of the border, until repeated attacks by Hezbollah insurgents led the Israeli government to seek a negotiated withdrawal. When talks failed, Israel simply left unilaterally in 2000 — under fire from Hezbollah, which claimed victory. The Second Lebanon War began in 2006, when Hezbollah kidnapped and killed several Israeli soldiers. Israel hit Hezbollah hard, but its ground forces, which had been focused on responding to the threat of the second Palestinian intifada, were ill-prepared and underequipped. While the Israeli Air Force (IAF) successfully pounded Hezbollah positions, civilian casualties prompted global protest, and the George W. Bush administration pushed Israel to accept a stalemate and a compromise — namely, United Nations Security Council Resolution 1701, which said Hezbollah had to withdraw north of the Litani River. Hezbollah ignored the resolution, and neither the United Nations nor Lebanon enforced it. That allowed Hezbollah to build a massive arsenal, and underground tunnels, which posed a threat to Israeli communities. Iran, which arms and funds Hezbollah, also used the terror organization as a deterrent against an Israeli attack on Iran’s nuclear program. Last October, Hezbollah began firing at Israel after Hamas launched its brutal terror attack in the southern part of the country. The Biden administration sought a diplomatic resolution, on the heels of his push in 2022 for a deal in which Israel gave up some of its offshore gas fields in exchange for vague guarantees Hezbollah would not start another war. But rather than a deal, Hezbollah preferred to continue firing at northern Israel, or at least to emerge with an agreement that would allow it to claim its intervention had forced Israel to accept an unfavorable ceasefire in Gaza. That appears to have been a major strategic blunder. In the space of two weeks, Israel has destroyed Hezbollah’s leadership and communications infrastructure, as well as much of its arsenal, and is now pressing its advantage. Prime Minister Benjamin Netanyahu appears determined to ensure that the Third Lebanon War does not end with the indeterminate result of the first two, but rather with Israeli victory, and a Lebanon free from enemy interventions. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "Hezbollah",
        "Israel",
        "Israel Defense Forces (IDF)",
        "Lebanon",
        "ground",
        "War",
        "Israeli",
        "IDF"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/watch-tim-sheehy-rips-jon-tester-montana-senate-debate/",
      "title": "Watch: Tim Sheehy Rips Jon Tester in Montana Senate Debate",
      "author": "Paul Bois",
      "content": "Republican challenger Tim Sheehy had a strong performance against Sen. Jon Tester (D) in the debate for Montana’s U.S. Senate race on Monday. Tester, who faces an uphill battle for reelection against the former U.S. Navy Seal, had a tough showing on Monday night as he and Sheehy discussed a variety of topics, from abortion to border security to housing prices. In one particularly strong moment from the debate, Sheehy contrasted his service in Afghanistan to Tester cozying up with lobbyists in D.C. “Sen. Tester knows all about backroom meetings; he’s been taking them for 20 years as the number-one recipient of lobbyist cash,” said Sheehy. “So if you want to talk about backroom meetings: while I was fighting in Afghanistan, he was eating lobbyist steak in D.C.” In another moment during the debate, the two discussed housing prices and the government’s role in fixing them. “I think the federal government getting involved more in housing projects, as we see, if you want the problem to get worse, then hand more of it to the federal government,” he said. “I think having Congress come in and having the federal government try to take over housing or price-fix housing, or start turning the knobs on a market, usually that ends up making things worse.” “We’ve seen that in education where we started federally backing student loans that have driven the cost of education through the roof. Folks are now realizing that taking on that amount of debt to get a degree may not be their best path after all. So building regulation has slowed a lot of building around the country,” he added. “Here in Montana, we’ve seen massive growth in only a handful of our communities across the state while other communities are suffering, and they like to have economic growth.” SBA Pro-Life America also fact-checked Jon Tester on whether or not he believed there should be a single national law on abortion in the United States. Because Tester did not answer, the group said on X, “Tester voted for a national all-trimester abortion mandate that would wipe out pro-life protections in every state.” On the issue of border security, Sheehy attacked the Biden-Harris administration for not sealing the U.S. Southern Border. Senate Democrats and White House Democrats created this border crisis,” Sheehy said. “We had a secure border four years ago. Donald Trump handed a sealed border to the Biden-Harris administration” “Kamala Harris, the border czar, with the help of her friends on the hill, like Sen. Tester and Chuck Schumer, opened the border wide open for three years, left it open. She refused to even go there. Democrats on the hill, refused to hold the administration accountable for the largest mass migration in the history of this country. We’ve never seen that many people come in in such a short period of time,” he added. While Sheehy thanked Tester for his service in the U.S. Senate, he reminded voters how he voted to impeach former President Donald Trump twice and said on CNN that Americans should punch Trump in the face. As Newsweek recently reported, Sheehy’s odds of beating Tester have steadily increased since entering the race. “A Napolitan News survey, conducted by RMG Research, of 491 likely voters found that 50 percent would back Sheehy, compared to 43 percent who would support Tester in November. In a previous Napolitan survey conducted in August, Tester was ahead in the Montana Senate race by 5 points (49 percent to 44),” it reported last week.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Jon Tester",
        "Montana",
        "Tim Sheehy",
        "debate",
        "Tim",
        "Sheehy",
        "Senate",
        "Tester",
        "border",
        "housing",
        "government"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/weather/2024/09/30/north-carolina-town-washedaway-hurricane-helene/",
      "title": "North Carolina Town ‘Washed Away’ by Hurricane Helene",
      "author": "Elizabeth Weibel",
      "content": "Among the communities affected by Hurricane Helene is the village of Chimney Rock, North Carolina, which has been described as being “washed away.” In a thread on X, Evan Donovan, a news anchor with WSOC-TV in Charlotte posted photos and videos showcasing the damage to the “tourist town.” “The homes on the other side of the water from Chimney Rock Village have walls completely sheared off,” Donovan wrote in another post. “Some look like they’re about to fall in the water.” Chimney Rock Village, which is located near Lake Lure, is where movies such as Dirty Dancing were filmed. As of 2022, the town had a population of over 200 people, according to census data. As of 2022, Lake Lure had a population of more than 1,570, according to census data. Ed Broyhill, who has a home located on the lake explained to Fox News that everything in the town had been “washed into the lake.” “The saddest thing in the world is that a lot of the folks have etched out a living catering to tourism,” Broyhill told the outlet. “They have everything from hotels and motels and restaurants and nice stores and souvenir stores and clothing stores, and all of that was washed away. Every bit of it, all of it, was washed into the lake.” Broyhill speculated that it could take “at least a year” to rebuild the tourist town, according to the outlet. As of Monday evening, there were roughly 376,577 customers in western North Carolina still without power, according to poweroutage.us.",
      "genre": "weather",
      "date": "30-09-2024",
      "keywords": [
        "Hurricane Helene",
        "North Carolina",
        "North",
        "Hurricane",
        "Carolina",
        "Helene",
        "washed",
        "town",
        "lake",
        "Broyhill",
        "Chimney"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/gofundme-authorized-trump-raises-1-million-support-hurricane-helene-victims/",
      "title": "GoFundMe Authorized by Trump Raises over $1 Million to Support Hurricane Helene Victims",
      "author": "Elizabeth Weibel",
      "content": "A GoFundMe authorized by former President Donald Trump to raise money for the people who have been affected by Hurricane Helene has raised over $1,000,000. “President Donald J. Trump has launched this GoFundMe campaign as an official response for MAGA supporters to offer their financial assistance to their fellow Americans impacted by Hurricane Helene,” the description on the GoFundMe page says. “With so many across the Southeastern U.S. facing challenges after the storm, President Trump is on the ground in communities to see the aftermath firsthand. All donations will be directed to help those most affected by Hurricane Helene.” As of Monday evening, the GoFundMe page had raised over $1,340,000 of its $1,000,000 goal. Among the names of people who had donated were former Sen. Kelly Loeffler (R-GA), rockstar Kid Rock, and UFC chief Dana White. On Monday, Trump visited Valdosta, Georgia, one of the communities that have been affected by Hurricane Helene. “Valdosta has been ravaged,” Trump said during a speech on Monday. “The town is very, very badly hurting, and many thousands are without power. They’re running low on food and fuel. We brought a lot of it down with us. It’s going to be distributed now or soon, throughout Georgia as well as North Carolina, South Carolina, Florida, Virginia, Alabama and Tennessee.” Other communities such as Asheville, North Carolina; Narrows, Virginia; and Chimney Rock, North Carolina were affected by Hurricane Helene. As of Monday, there were roughly 301,416 customers in North Carolina still without power, according to poweroutage.us. And in southwestern Virginia, there were roughly 77,607 customers still without power, according to poweroutage.us.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "economy",
        "Georgia",
        "GoFundMe",
        "hurricane",
        "Hurricane Helene",
        "North Carolina",
        "Helene",
        "Trump",
        "authorized",
        "Carolina",
        "Monday"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/harris-surrogate-we-have-had-a-soft-landing-trump-wont-have-stability/",
      "title": "Harris Surrogate: ‘We Have Had a Soft Landing,’ Trump Won’t Have ‘Stability’",
      "author": "Ian Hanchett",
      "content": "On Monday’s broadcast of CNBC’s “Squawk Box,” Commerce Secretary Gina Raimondo — who was appearing in her personal capacity as a surrogate for the Harris campaign — stated that “we have had a soft landing,” and “we need stability, predictability,” which you won’t get from 2024 Republican presidential candidate former President Donald Trump. Raimondo stated that Trump would cause a recession based on his tariff policies alone, and added, “he’s talking about — depending on the day, of course — but he has talked about a 60% or 100% tariff on goods coming in from China. That alone, I don’t think we realize the disruption that that will cause. A tariff on all imports, first of all, that’s anti-American, that would disrupt our economy, the global economy. So, I think that alone could kick us into a recession for sure. But, also, I just think, look, we have had a soft landing, okay? Inflation, we haven’t slayed it totally. It is on the way down. We just need — we need stability, predictability, and what you’ll have in him is unpredictable, chaotic, based upon how he feels on a particular day, and I do worry that the tariffs — but, last week he said 200% tariff on John Deere. Where does that come from? That will only raise prices and put people out of work at John Deere.” Follow Ian Hanchett on Twitter @IanHanchett",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "Bidenomics",
        "Gina Raimondo",
        "Kamala Harris",
        "harris",
        "surrogate",
        "soft",
        "landing",
        "trump",
        "tariff"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/msnbcs-reid-less-lucid-trumps-racism-is-pouring-out/",
      "title": "MSNBC’s Reid: ‘Less-Lucid’ Trump’s Racism Is Pouring Out",
      "author": "Pam Key",
      "content": "MSNBC host Joy Reid claimed Monday on “Inside” that former President Donald Trump was “less-lucid,” so his “racism” was pouring out. Reid said, “I think I will echo George Conway, in saying that Donald Trump, he called him a lunatic, I will not use that term but he is clearly in decline. Everything about Donald Trump, yes, it is worse than 2016 or 2020 because he is clearly in decline. He cannot start a story without veering off into a fictional award that he supposedly won. He cannot answer a question with any lucidity. Donald Trump is less-lucid. He is also less inhibited. That means that his inmate racism pours out in greater measure now than it did before. He cannot control himself.” She added, “What he is telling his voters, his small, his share of extreme MAGA voters is these blacks are stealing the election. Black Haitians are violent cannibals, black people are the enemy, black people will be responsible if/when I use lose. You are permitted, through my language, to do violence if necessary to stop another peaceful transfer of power. He understands that he is not winning the election. You and I both are campaign people and he is not winning the election. What he is doing is he doing what he did in the summer 2016. He is setting up to say if I lose, they stole it. He did in 2016, he just happen to win those states. He did in 2020 and he is doing it again.” Follow Pam Key on X @pamkeyNEN",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "2024 Presidential Election",
        "Donald Trump",
        "Joy Reid",
        "MSNBC",
        "Trump",
        "lucid",
        "racism",
        "pouring",
        "Donald",
        "election",
        "people",
        "Reid"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/klobuchar-biden-harris-have-been-strong-on-keeping-tariffs-trumps-would-be-a-tax/",
      "title": "Klobuchar: Biden-Harris Have Been Strong on ‘Keeping’ Tariffs, Trump’s Would Be a Tax",
      "author": "Ian Hanchett",
      "content": "On Monday’s broadcast of MSNBC’s “ReidOut,” Sen. Amy Klobuchar (D-MN) stated that the Biden-Harris administration has “been very strong on” Chinese steel dumping “and keeping those tariffs in place.” But 2024 Republican presidential candidate former President Donald Trump’s tariff proposal “would amount to this tax, as opposed to using it, when necessary, with specific industries and specific countries.” Klobuchar began by saying, “Donald Trump’s proposal would [amount] to a $4,000 national sales tax on every American family.” Host Joy Reid then said, “People are literally calling what Trump is trying to initiate a tequila tax. Because I don’t think people fully understand, a massive tariff like what McKinley had…what you’re talking about is, your imported tequila, your imported beer that comes from Mexico, your imported beer from Germany, and your TVs, your video game systems, all of it goes up by the percentage of that tax — of that tariff.” After agreeing with Reid’s point, Klobuchar added, “And to be clear, there’s a place for tariffs, right? When you see, like, steel dumping from China and the Biden-Harris administration have been very strong on that and keeping those tariffs in place. There is a place for it. But he would have this be a global-wide, national tariff that would amount to this tax, as opposed to using it, when necessary, with specific industries and specific countries.” Follow Ian Hanchett on Twitter @IanHanchett",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "Amy Klobuchar",
        "Donald Trump",
        "Joe Biden",
        "Kamala Harris",
        "Tariffs",
        "klobuchar",
        "biden",
        "harris",
        "strong",
        "keeping",
        "tax",
        "specific",
        "tariff",
        "imported"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/economy/2024/09/30/port-workers-prepare-strike-deadline-looms-closer/",
      "title": "Port Workers Prepare to Strike as Deadline Looms Closer",
      "author": "Elizabeth Weibel",
      "content": "Thousands of workers at more than a dozen ports throughout the United States are preparing to go on strike as the deadline for their union and the United States Maritime Alliance (USMX) to reach an agreement looms closer. Dockworkers with the International Longshoremen’s Association (ILA), who work at roughy 14 ports along the East Coast and the Gulf of Mexico are set to go on strike as of October 1 if their union and the USMX do not reach an agreement regarding their labor contract, according to the Hill. Roughly “25,000 port workers employed in contain and roll-on/roll-off operations at ports on the U.S. East and Gulf Coasts” are currently covered under the current agreement, according to the USMX. The ILA is described as being the “largest union of maritime workers in North America,” and represents roughly 85,000 longshoremen located along “the Atlantic and Gulf Coasts, Great Lakes, major U.S. rivers, Puerto Rico and Eastern Canada,” according to the union’s website. A report from the Conference Board found that if the workers do go on strike, it could “cause serious economic fallout.” “Just a one-week strike could cost the US economy $3.78 billion (i.e., $540 million per day),” the Conference Board wrote in the report. The report also noted that if the port workers go on strike, it would “come at a critical time” ahead of the November presidential election and “as retailers scramble to finish importing inventory to ensure customers are well supplied ahead of the busy holiday shopping season.” While President Joe Biden indicated that he would not intervene in the strike, under the Taft-Hartley Act, Biden would be allowed to get involved and “request an 80-day court-ordered cooling-off period,” according to the Hill. Ahead of the potential strike, Americans were reported to be stocking up on “essential supplies,” Fox Business reported. One person told the outlet that the possible strike had them “worried,” adding that it was “hard to be able to make ends meet as it is.” Update 12:13 am ET: The NY Times reports, “Both sides have moved off their previous positions,” the Maritime Alliance said in a news release. “We are hopeful that this could allow us to fully resume collective bargaining.”",
      "genre": "economy",
      "date": "30-09-2024",
      "keywords": [
        "business",
        "economy",
        "Joe Biden",
        "strike",
        "Unions",
        "deadline",
        "looms",
        "closer",
        "workers",
        "union",
        "USMX",
        "agreement"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/sports/2024/09/30/mlb-legend-pete-rose-dies-83/",
      "title": "MLB Legend Pete Rose Dies at 83",
      "author": "Dylan Gwinn",
      "content": "Major League Baseball’s all-time hit leader, Pete Rose, died Monday at his home in Las Vegas, according to TMZ Sports. He was 83 years old. “Pete’s agent, Ryan Fiterman of Fiterman Sports, confirmed the news, saying, ‘the family is asking for privacy at this time,'” TMZ Sports reports. Rose’s accomplishments as a player are the stuff of legend. During his 24-year career, which was almost entirely spent with the Reds and Phillies, the player known as “Charlie Hustle” amassed 4,256 hits (an MLB record), 160 home runs, 1,314 RBIs, and a lifetime batting average of .303. In addition, he was named to the MLB All-Star Game 17 times and became the 1973 NL MVP. Rose also won three World Series titles with the Reds and Phillies. Rose returned to the Reds as a player-manager in 1986. Three years later, in 1989, then-MLB Commissioner A. Bartlett Giamatti signed an agreement in which Rose agreed to a lifetime ban in return for the league not making a formal determination about whether or not he had bet on baseball. The agreement gave Rose some leeway to say he never wagered on baseball. However, in the mid-2000s, he eventually admitted that he had. Though Rose eventually gained entry into the Reds Hall of Fame, MLB never rescinded its ban.",
      "genre": "sports",
      "date": "30-09-2024",
      "keywords": [
        "Cincinnati Reds",
        "MLB",
        "Philadelphia Phillies",
        "sports gambling",
        "Rose",
        "Pete",
        "time",
        "TMZ",
        "Reds",
        "player",
        "Sports",
        "Pete Rose"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/health/2024/09/30/memphis-sisters-fatally-overdose-fentanyl-3-months-apart/",
      "title": "Memphis Sisters Fatally Overdose on Fentanyl 3 Months Apart",
      "author": "Olivia Rondeau",
      "content": "A Memphis, Tennessee, woman is now raising five of her grandchildren after losing her two daughters to fentanyl just months apart. “I’m about all they’ve got, except for their uncles,” the grieving mother, Brenda Diggs, told WREG of her grandkids. “I just don’t know. It’s mind-boggling.” Her eldest daughter, 42-year-old Kenia Everette Wooten, was trying to turn her life around when she became addicted to drugs. According to Diggs, Kenia “lost her self-esteem” after becoming a mom at just 15. “And I guess she thought building her self-esteem and having sex with guys would make her feel better about herself. She just spiraled and it just was bad,” the mom recounted. Even with the hardships of becoming a teen mother, Diggs said Kenia had begun to get her life together when she was injured at work. “She hurt her ankle, real bad. In fact, I think she broke it, and then they put her on some kind of medicine,” the mom told the outlet. By the time her prescription was up, Kenia was addicted to pills. “That’s when she decided she could buy other people’s prescriptions,” said Diggs. It was January 22, 2022, when she got the call that her daughter was dead. “[Kenia’s boyfriend] called me, ‘Ms. Brenda, Kenia’s dead.’ I’m like, ‘What? What are you talking about?’ I’m asleep, and he’s like ‘she died. She took something and she died,'” she recalled. Diggs got up and rushed to the hotel where Kenia was staying, but it was too late. “I went in, and lo and behold, Kenia was on the floor. The paramedics were there, but she was dead on the floor.” The cause of death was ruled as an accidental overdose of fentanyl. Kenia’s younger sister, 34-year-old Keshia Diggs, had also just been released from a prison stint stemming from prostitution charges. In just three months, she would die from a fentanyl overdose as well. Diggs became worried on March 25, 2022, when Keshia did not come home after having been out for a number of days. The mom discovered that her daughter had never actually left when she checked her bedroom. “Went in there, and the smell just almost knocked me out. Like, what is that smell,” Diggs said. “I lost it. I ran out screaming, you know and ran down the stairs and outside with my phone. I called 911, and, you know, I told them, I said, my daughter’s not right. Can you please send somebody I think she’s sick or something?” “Lo and behold, they said it was fentanyl. She died of an accidental overdose of fentanyl.” Diggs said she noticed that her younger daughter was using some type of drug when she saw her “nodding” out while doing her hair. “She was just out of it, like, ‘What is wrong with you?’ I’m thinking to myself, she’s doing something.” Diggs has been left to put together the broken pieces of her family after the deadly opioid took both daughters from her. David Fuller, an overdose prevention specialist with the Memphis Area Prevention Coalition, said the stories of families experiencing losses like this are far too common. “I wish I could say that that was the first one of those stories that I’ve heard. But it’s absolutely not,” he told WREG. Many people do not even realize they are consuming fentanyl, he explained. “They thought they were doing heroin or something else,” Fuller said. “Then what we saw is fentanyl began to infiltrate the rest of the drug supply. Counterfeit pills. Counterfeit prescription opioids.” “It’s so powerful that once a user becomes addicted to fentanyl, other drugs are not going to cut it because they’re not strong enough,” he continued, adding that fentanyl is the “deadliest drug that we’ve seen in this country.” Provisional data from the Centers for Disease Control and Prevention (CDC) revealed that approximately 107,543 people fatally overdosed on drugs in the U.S. in 2023. While the CDC does not break down the categories to see the exact number of fentanyl deaths, the most recent data from 2022 shows that 74,000 drug overdose deaths involved synthetic opioids other than methadone — of which the most popular is fentanyl. As tens of thousands of Americans die each year from the drug, amounts of fentanyl that could kill millions of people are being seized all over the country. In August, the Citrus County Sheriff’s Office of Florida found over 13 pounds of fentanyl — enough to kill three million people, Breitbart News reported. In another recent Florida incident, two pounds of fentanyl was found washed up on Daytona Beach in September. Meanwhile, a traffic stop in Roswell, Georgia, yielded enough fentanyl to kill roughly 60,000 people. An April report by the House Select Committee on the Chinese Communist Party (CCP) validated a key claim in New York Times bestselling author Peter Schweizer’s latest book, Blood Money — that China has been subsidizing the production and export of fentanyl precursor chemicals and other synthetic narcotics. “Specifically, there’s a Chinese gang called UBG that’s widely credited with setting up the Sinaloa Cartel in Mexico and making them the kings of fentanyl,” Schweizer told Fox News in March. “The leader of that gang is a guy named Chang An-lo who goes by the name White Wolf. It was White Wolf’s business with [a] partner who wired a $5 million if interest-free, forgivable loan to the Biden family,” the investigative journalist said. “And it was specifically designated not just for Hunter, for the family. So does Joe Biden want to have a conversation about these tough issues? Does he want to hold China to account? Absolutely not, and I’m convinced it’s because of these financial entanglements.”",
      "genre": "health",
      "date": "30-09-2024",
      "keywords": [
        "Drug overdose deaths",
        "fentanyl",
        "fentanyl crisis",
        "illegal drugs",
        "Memphis",
        "Opioid Crisis",
        "Tennessee",
        "months",
        "Diggs",
        "Kenia",
        "people",
        "drug"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/moskowitz-on-israel-ignoring-bidens-hezbollah-ceasefire-calls-glad-israel-ditched-appeasement-that-led-to-10-7/",
      "title": "Moskowitz on Israel Ignoring Biden’s Hezbollah Ceasefire Calls: ‘Glad’ Israel Ditched ‘Appeasement’ that Led to 10/7",
      "author": "Ian Hanchett",
      "content": "On Monday’s broadcast of NewsNation’s “Elizabeth Vargas Reports,” Rep. Jared Moskowitz (D-FL) responded to Israel launching attacks on Hezbollah despite President Joe Biden’s calls for a ceasefire by stating that he’s “glad Israel is at the point now that they’re no longer going to allow these threats to exist on their border. We saw what appeasement strategy looks like. It looks like what Hamas did on October 7. There was a ceasefire in place, and then Hamas launched war.” Host Elizabeth Vargas asked, “I want to get your thoughts on what’s happening today in the Middle East. … There are reports today that Israeli troops are amassing along the Lebanese border, special forces raids from the IDF are already rading and going into Lebanon. What is your sense? I know that President Biden has been urging calm and hoping for a ceasefire. That does not look like that’s about to happen. There were reports today from U.S. officials that they had convinced Israel not to launch a ground invasion. What do you think is going on?” Moskowitz responded, “Well, first, let me say good. I’m glad Israel is at the point now that they’re no longer going to allow these threats to exist on their border. We saw what appeasement strategy looks like. It looks like what Hamas did on October 7. There was a ceasefire in place, and then Hamas launched war. By the way, Hezbollah could have stayed out of that. But instead, Hezbollah came to the aid of Hamas and launched over 9,000 rockets into Israel, killed 16 kids on a soccer field, made 50,000 people flee their home[s] in the north of Israel. I don’t want to see a regional war and I don’t want to see a full-scale invasion of Lebanon. I do think Israel is going to do limited missions to kind of push Hezbollah terrorists and militants back further into Lebanon and continue to degrade Hezbollah’s capability to threaten Israel. Look, on October 7, Israel looked like a soft target. They looked like a soft target to Iran. The last couple of weeks, it doesn’t look so much like a soft target. It’s important that Israel re-establishes that deterrence so that Iran realizes that there’s — that they no longer want to mess with the state of Israel.” Follow Ian Hanchett on Twitter @IanHanchett",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "Ceasefire",
        "Hezbollah",
        "Jared Moskowitz",
        "Joe Biden",
        "Israel",
        "moskowitz",
        "Appeasement",
        "Ditched",
        "Hamas",
        "launched"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/dearborn-memorial-service-mourns-perfect-hezbollah-chief-nasrallah-accuses-u-s-terrorism/",
      "title": "Dearborn Memorial Service Mourns ‘Perfect’ Hezbollah Chief Nasrallah, Accuses U.S. of ‘Terrorism’",
      "author": "Joshua Klein",
      "content": "A memorial service for Hezbollah leader Hassan Nasrallah in Michigan featured praise for prominent terror figures as well as denunciations of the United States’ “terrorism.” On Saturday, a memorial service for slain Hezbollah Secretary-General Hassan Nasrallah took place at the Hadi Youth Community Center in Dearborn, Michigan. The event, which was live-streamed on YouTube, featured fiery speeches from local religious leaders and activists who praised Nasrallah and Iran’s leadership while condemning America. Imam Usama Abdulghani, who led the memorial, declared that Nasrallah was now “happy,” and that his martyrdom “at the hands of the wickedest and most evil of Allah’s creations” was a “reward” from Allah for all of the “jihad’ he has waged. Teacher and activist Tarek Bazzi delivered a passionate speech, celebrating not only Nasrallah but also the Iranian revolutionaries who shaped Hezbollah’s ideology. He praised Iran’s former leader Ruhollah Khomeini and current Supreme Leader Ali Khamenei, calling Nasrallah “immaculate” and “perfect.” Offering condolences to “the entire Muslim nation,” Bazzi challenged attendees to identify any other religion that has produced men as “godly” as Khomeini, late Revolutionary Guard Gen. Qassem Soleimani, slain Hamas leader Ismail Haniyeh, and others, naming several key figures revered in Hezbollah and Iranian circles. In a sharp denunciation of U.S. policy, Bazzi accused American institutions — specifically the White House, Congress, and the Pentagon — of projecting their own “terrorism” onto “the soldiers and saints of the Lord of the universe.” The service was also marked by local Shiite poet Hassan Salamey, who referred to Iran’s Supreme Leader Khamenei as “our greatest leader,” while warning he may possess Ali’s sword “on your throats in Tel Aviv.” Dearborn, with its large Muslim population, has long been a focal point for anti-Israel demonstrations, drawing attention to growing radicalism within the U.S. In April, a viral video showed anti-Israel protests in Dearborn, where demonstrators were captured chanting, “Death to America” and “Death to Israel,” during an International Al-Quds Day rally. The video stirred national controversy and intensified scrutiny of pro-Hezbollah activities in the U.S. The clip showed activists condemning both Israel and America in the harshest of terms, with Bazzi insisting the chants were only logical. In response, Steven Stalinsky, director of the Middle East Media Research Institute (MEMRI), told Fox News that the Dearborn rallies have been happening for over 20 years and have become a “hotbed of hate,” where rallies and sermons can be seen “in support for Hamas, Hezbollah, [and] Iran.” Nasrallah, who served as Secretary-General of Hezbollah since 1992, was a founding member of the Iran-backed Shiite terror group. Revered by Hezbollah supporters for leading the group through conflicts with Israel, Nasrallah was killed on Saturday in a precision airstrike on his Beirut bunker. Under his leadership, Hezbollah’s terrorism capabilities grew significantly. Israel has been engaged in ongoing clashes with Hezbollah after the group launched attacks following Hamas’s October 7 assault on Israeli civilians, which left nearly 1,200 dead and more than 240 hostages taken. Having actively sought to expand its influence beyond the Middle East, Hezbollah is designated a terrorist organization by more than a dozen countries and international entities, including major Western nations, members of the European Union, and most Arab League member states, due to its involvement in terrorist activities against American, French, Israeli, and other targets. Former President Donald Trump has denounced Hezbollah, stating, “No terrorist group other than al-Qaeda has more American blood on its hands.” On Sunday, Arkansas Republican Sen. Tom Cotton called for the elimination of “all of Hezbollah’s leadership” while insisting that the United States “should let Israel win” against Tehran’s key terrorist proxy in the region. Joshua Klein is a reporter for Breitbart News. Email him at jklein@breitbart.com. Follow him on Twitter @JoshuaKlein.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "Ali Khamenei",
        "Dearborn Michigan",
        "Hassan Nasrallah",
        "Hezbollah",
        "Iran",
        "jihad",
        "Martyrdom",
        "Dearborn",
        "service",
        "memorial",
        "Nasrallah",
        "Israel",
        "leader",
        "Bazzi"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/entertainment/2024/09/30/directv-buys-rival-dish-as-it-fights-the-onslaught-of-streaming-services/",
      "title": "DirecTV Buys Rival Dish as It Fights the Onslaught of Streaming Services",
      "author": "Breitbart News",
      "content": "DirecTV is buying Dish and Sling, a deal it has sought to complete for years, as the company seeks to better compete against streaming services that have become dominant. DirecTV said Monday that it will acquire Dish TV and Sling TV from its owner EchoStar in a debt exchange transaction that includes a payment of $1, plus the assumption of approximately $9.8 billion in debt. The prospect of a DirecTV-Dish combo has long been rumored, with headlines about reported talks popping up over the years. And the two almost merged more than two decades ago — but the Federal Communications Commission blocked their owners’ then-$18.5 billion deal, citing antitrust concerns. The pay-for-TV market has shifted significantly since. As more and more consumers tune into online streaming giants, demand for more traditional satellite continues to shrink. And, although high-profile acquisitions have proven to be particularly tough under the Biden-Harris administration, that may make regulators more inclined to approve DirecTV and Dish’s pairing this time around. DirecTV said Monday that the transaction will help it bring smaller content packages to consumer at lower prices and essentially provide a one-stop shopping experience for entertainment programming. It’s hoping this will appeal to those who have left satellite video services for streaming. The company said that combined, DirecTV and Dish have collectively lost 63% of their satellite customers since 2016. “DirecTV operates in a highly competitive video distribution industry,” DirecTV CEO Bill Morrow said in a statement. “With greater scale, we expect a combined DirecTV and Dish will be better able to work with programmers to realize our vision for the future of tv, which is to aggregate, curate, and distribute content tailored to customers’ interests, and to be better positioned to realize operating efficiencies while creating value for customers through additional investment.” The current deal could provide a key lifeline for EchoStar. The Colorado-based telecommunications company has reportedly faced the prospect of bankruptcy as it continues to burn through cash and see losses pile up. In a recent securities filing, EchoStar disclosed that it had just $521 million in “cash on hand.” And the company forecast negative cash flows for the remainder of the year — while also pointing to major looming debt payments, with more than $1.98 billion of debt set to mature in November. “With an improved financial profile, we will be better positioned to continue enhancing and deploying our nationwide 5G Open RAN wireless network,” EchoStar President and CEO Hamid Akhavan said. “This will provide U.S. wireless consumers with more choices and help to drive innovation at a faster pace.” By shedding Dish, EchoStar will be able to focus its efforts elsewhere, like its wireless carrier Boost Mobile. “We are playing to win in the wireless business. there’s no doubt about it,” Akhavan said during a conference call, adding that the company may need to seek additional funding and financing in the future to achieve its goals. Shares of EchoStar fell more than 14% in Monday midday trading. The DirecTV and Dish deal is targeted to close in 2025’s fourth quarter. But it is contingent on several factors, including regulatory approvals and bondholders writing off nearly $1.6 billion in debt related to Dish. The combined company will be based in El Segundo, California. “We believe regulatory approval is likely to be greater than 50% given the opportunity for the combined company to improve its competitiveness to offer a range of linear video packages as well as to take a more aggressive stance on offering a live streaming video product,” Michael Rollins of Citi Investment Research wrote in a note to clients. But the analyst added that there’s still significant uncertainty related to whether or not the Federal Communications Commission, Department of Justice and other possible regulators give the necessary approvals, based on previous talks with company management and industry experts over the last few years. Shortly before DirecTV made its announcement, AT&T said it was selling its remaining stake in DirecTV to private equity firm TPG in a deal valued at about $7.6 billion. The move ends the communication giant’s remaining ties to the entertainment industry. AT&T said Monday in a filing with the Securities and Exchange Commission that it will receive payments from TPG and DirecTV for its remaining 70% stake in the satellite TV company. This includes $1.7 billion in the second half of the year and $5.4 billion next year. The remaining amount will be paid in 2029. AT&T purchased DirectTV for $48.5 billion back in 2015. But in 2021, following the loss of millions of customers, AT&T sold a 30% stake of the business to TPG for $16.25 billion. AT&T’s deal is expected to close in the second half of 2025.",
      "genre": "entertainment",
      "date": "30-09-2024",
      "keywords": [
        "DirecTV",
        "Dish Network",
        "streaming",
        "services",
        "Dish",
        "company",
        "billion",
        "deal"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/law-and-order/2024/09/30/fbi-pay-dozens-female-recruits-22-million-discrimination-harassment-lawsuit/",
      "title": "FBI Agrees to Pay Dozens of Female Recruits over $22 Million in Discrimination, Harassment Lawsuit",
      "author": "Olivia Rondeau",
      "content": "The Federal Bureau of Investigation (FBI) has agreed to pay out more than $22 million to female recruits who sued the bureau over alleged sexual discrimination and harassment at its training academy in Virginia. The class-action lawsuit, filed in 2019, claims that dozens of women were dismissed from the Quantico law enforcement academy due to their sex and “routinely” faced harassment from instructors, the Associated Press (AP) reported. The alleged harassment included inappropriate sexual advances, remarks on recruits’ breast sizes, false allegations of infidelity, and telling recruits to take contraceptives to “control their moods,” the lawsuit states. In one of its largest ever settlement agreements, the FBI said Monday that they will pay the 34 complainants — a move that still needs to be approved by a federal judge, according to the AP. “These problems are pervasive within the FBI and the attitudes that created them were learned at the academy,” said the plaintiffs’ attorney, David J. Shaffer. “This case will make important major changes in these attitudes.” According to the female recruits, they suffered in a hostile working environment where they were “excessively targeted for correction and dismissal in tactical situations for perceived lack of judgment” and subjective “suitability” criteria. “Through passive tolerance, the FBI has intentionally allowed the Good Old Boy Network to flourish unrestrained at the FBI Academy,” the suit argues. While agreeing to the multi-million-dollar payout, the FBI said in a Monday statement obtained by the AP that it has “taken significant steps over the past five years to further ensure gender equity in the training and development of all our trainees.” The settlement also includes a chance for the dismissed recruits to re-enter FBI training with “guaranteed placement” in one of their preferred field offices for those who meet the requirements The FBI has also “agreed to a review by outside experts who will work to ensure that female recruits face a fair evaluation process,” the outlet reported. According to Shaffer, it is too late for some women to come back, as they have already moved on to other fields. “The FBI has deprived itself of some genuinely exceptional talent,” the attorney said. A 2020 investigation conducted by the AP identified “several” senior FBI officials who “quietly” resigned from their positions with full benefits after allegations of sexual misconduct. The accused officials even maintained anonymity, reportedly “allowing them to land on their feet in the private sector or even remain in law enforcement.” The allegations against them included unwanted touching, sexual advances, and coercion against women within the bureau. “In one case, an FBI assistant director retired after the inspector general’s office concluded he harassed a female subordinate and sought an improper relationship with her,” the outlet noted as an example. The payout agreement comes just months after a $138.7 million settlement with the victims of disgraced former Team USA Dr. Larry Nassar was reached due to the FBI’s failure to intervene and stop the sexual abuse.",
      "genre": "law-and-order",
      "date": "30-09-2024",
      "keywords": [
        "FBI",
        "gender discrimination",
        "lawsuit",
        "Quantico",
        "settlement",
        "sexual harassment",
        "female",
        "recruits",
        "discrimination",
        "harassment",
        "sexual",
        "allegations"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/walzs-alleged-ties-chinese-communist-party-deepen-eve-debate-with-vance/",
      "title": "Walz’s Alleged Ties to Chinese Communist Party Deepen on Eve of VP Debate with Vance",
      "author": "Paul Bois",
      "content": "Rep. James Comer (R-KY) has subpoenaed Homeland Security Secretary Alejandro Mayorkas about unspecified allegations of Chinese Communist Party (CCP) connections against Democrat Minnesota Gov. Tim Walz. In a letter accompanying the subpoena released on Thursday, Comer said the House Oversight and Accountability Committee received information from a whistleblower about “serious concern among Department of Homeland Security (DHS) personnel regarding a longstanding connection between” Tim Walz and the Chinese Communist Party (CCP). The letter was issued just one day before Walz is set to debate Trump vice-presidential pick JD Vance in the televised debate on Tuesday. Per the Hill: Specifically, Comer pointed to a nonclassified chat that DHS employees used on Microsoft Teams titled “NST NFT Bi-Weekly Sync” that he said contains relevant information, in addition to further classified and unclassified documents in the control of DHS. The acronym stands for “Nation State Threat — National Functional Team,” according to the committee. Comer did not go into detail about what kind of concerns were raised about Walz’s alleged connection to China but said the information came through a whistleblower. The subpoena gave a deadline of Oct. 7 to produce the communication in the Microsoft Teams group chat relating to Walz from July 1, 2024, to present, as well as any intelligence information reports or regional intelligence notes since Nov. 2023 to present relating to Walz, his staff, or his gubernatorial office. The letter specified that the committee began investigating CCP influence in the United States government “long before Governor Walz was elevated to be the vice-presidential candidate” for Kamala Harris. “In particular, if a state governor and major political party’s nominee for Vice President of the United States has been a witting or unwitting participant in the CCP’s efforts to weaken our nation, this would strongly suggest that there are alarming weaknesses in the federal government’s effort to defend the United States from the CCP’s political warfare that must be urgently addressed,” Comer wrote. A former educator, Walz spent a year teaching in China in 1989 and visited the country many times afterwards while leading field trips to the country. House Republicans have been questioning his ties to the CCP since Kamala Harris tapped him as her VP pick. The letter from Comer dropped on the same day that the Washington Free Beacon released a report debunking a claim Walz made during a 2014 congressional hearing wherein he said that he had been in Hong Kong during China’s Tiananmen Square massacre in 1989. Walz was, in fact, at home in Nebraska at the time. “I was just going to teach high school in Foshan in Guangdong, and was in Hong Kong in May of ‘89,” he said at the time. “And as the events were unfolding, several of us went in. And I still remember the train station in Hong Kong.” “There was a large number of, especially European, I think, very angry that we would still go after what had happened, but it was my belief at that time that the diplomacy was going to happen on many levels,” he added. Media outlets from New York Times, CBS News, and National Public Radio have repeated Walz’s story when “in reality, local news reports show that Walz was at home in Nebraska in May and June of 1989, as protests convulsed China and the government’s response turned the world’s attention to its gross human rights violations,” according to the Beacon. Walz did not depart for China until August that year. “Contemporaneous news reports show Walz touring a National Guard storeroom in Alliance, Nebraska, in May 1989. They indicate that Walz did not leave the United States until August of that year, at least two months after the student protests ended with the Tiananmen Square massacre,” the report added.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Alejandro Mayorkas",
        "China",
        "James Comer",
        "Tiananmen Square",
        "Tim Walz",
        "walzs",
        "Eve",
        "Tim",
        "Gov",
        "connections",
        "Walz",
        "Comer",
        "letter",
        "United"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/trump-assassination-suspect-ryan-wesley-routh-pleads-not-guilty/",
      "title": "Trump Assassination Suspect Ryan Wesley Routh Pleads Not Guilty",
      "author": "Elizabeth Weibel",
      "content": "The suspect who allegedly attempted to assassinate former President Donald Trump pleaded not guilty to the charges brought against him. Ryan Wesley Routh was previously charged with the “attempted assassination of a major presidential candidate, possessing a firearm in furtherance of a crime of violence, assaulting a federal officer,” possessing a firearm and ammunition as a convicted felon, and possessing a firearm that had an obliterated serial number, according to a press release from the Department of Justice (DOJ). On Monday, Routh appeared before United States Magistrate Judge Bruce Reinhart, and defense attorneys for Routh reportedly “entered a not guilty plea” and asked for “a jury trial,” according to NBC News. The not-guilty plea from Routh comes after a federal grand jury charged Routh with the attempted assassination of Trump after prosecutors had indicated that they intended to seek an assassination charge against the suspect. Routh had initially been charged with possessing a firearm as a convicted felon and with possessing a firearm with a destroyed serial number. The charges against Routh came the day after the U.S. Secret Service allegedly saw the barrel of his AK-style rifle through the fence where he had been hiding in the bushes near Trump International Golf Course West Palm Beach where Trump was playing golf. After being spotted, Routh reportedly fled the scene before being apprehended. As Breitbart News previously reported, agents discovered a GoPro camera, two backpacks, and an AK-47-style rifle where Routh had been hiding. The second assassination attempt comes after gunman Thomas Matthew Crooks opened fire at Trump’s July 13, 2024, rally in Butler, Pennsylvania. Trump was shot by a “bullet that pierced the upper part” of his right ear.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "assassination attempt",
        "Department of Justice (DOJ)",
        "Donald Trump",
        "Ryan Wesley Routh",
        "Ryan",
        "Routh",
        "guilty",
        "Trump",
        "assassination",
        "possessing",
        "firearm"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/dhs-keeps-detention-space-unfilled-half-million-criminal-migrants-live-across-us/",
      "title": "DHS Keeps Detention Space Unfilled as Over Half a Million Criminal Migrants Live Throughout U.S.",
      "author": "John Binder",
      "content": "President Joe Biden and Vice President Kamala Harris’s Department of Homeland Security (DHS) has kept detention space, meant for migrants considered a priority for deportation, unfilled as more than half a million known criminal migrants live throughout the United States. Immigration and Customs Enforcement (ICE) data, divulged to Congress last week, reveals that the agency’s non-detained docket includes over 425,000 convicted criminal migrants and more than 222,000 migrants with pending criminal charges. By the end of the year, more than eight million migrants will be on ICE’s non-detained docket. Those on the non-detained docket are known to ICE but live in American towns and cities while awaiting their deportation hearings. For perspective, when former President Donald Trump left office in early 2021, only about 3.2 million migrants were on ICE’s non-detained docket, indicating that Biden and Harris have almost tripled the docket’s population. Meanwhile, Biden and Harris’s DHS has kept ICE detention beds unfilled. Congress currently funds 41,500 detention beds, but the latest federal data shows DHS is only utilizing 37,395 detention beds, leaving more than 4,100 beds open and available but unused. A recent report from the House Homeland Security Committee detailed that while Biden and Harris have sought to cut detention bed space, more than 85 percent of migrants arriving at the southern border are ultimately being released into the U.S. interior. Only a fraction are monitored by DHS through the Alternatives to Detention (ATD) program. In April, Acting ICE Director Patrick Lechleitner urged Congress to fund at least 50,000 detention beds. Other experts have suggested that the federal government needs hundreds of thousands of detention beds to keep up with record illegal immigration and ensure that migrants are not released into the U.S. interior. John Binder is a reporter for Breitbart News. Email him at jbinder@breitbart.com. Follow him on Twitter here.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Alejandro Mayorkas",
        "Department of Homeland Security (DHS)",
        "illegal aliens",
        "illegal immigration",
        "Immigration and Customs Enforcement (ICE)",
        "Joe Biden",
        "Kamala Harris",
        "migrants",
        "President",
        "space",
        "unfilled",
        "criminal",
        "detention",
        "ICE",
        "beds",
        "docket",
        "DHS"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/commerce-secy-havent-been-particularly-involved-on-port-strike-that-could-be-incredibly-disruptive-to-commerce/",
      "title": "Commerce Sec’y: ‘Haven’t Been Particularly Involved’ on Port Strike that ‘Could Be Incredibly Disruptive to Commerce’",
      "author": "Ian Hanchett",
      "content": "On Monday’s broadcast of CNBC’s “Squawk Box,” Commerce Secretary Gina Raimondo — who was appearing in her personal capacity as a surrogate for the Harris campaign — stated that she has “not been very focused on” where a potential port strike could have the biggest impact and hasn’t “been particularly involved” in the strike issue that she acknowledged “could be incredibly disruptive to commerce.” Co-host Becky Quick asked, “I realize you’re here as a surrogate for the vice president’s campaign, but there’s so much news of the day that I feel we have to ask you about. I wanted to start with this potential strike at the ports that’s expected to take place tonight at midnight. Obviously, this is the first time since the 1970s that you would see strikes all up and down, not only the east coast, but the Gulf ports. What would this mean for commerce in this country, what would this mean for businesses if we go into this strike, and what do you know about it?” Raimondo responded, “So, as you said, I’m here in my personal capacity. I would say, look, it’s not a secret that this would be — depending on how long it lasts — could be incredibly disruptive to commerce. As you well know, … so much commerce moves through the ports, and, if it goes a few days, I think, I’m sure, companies probably have their plans set. But especially, we’re in peak season getting ready for the Christmas season. If a strike were to drag on, I think it could be really, very, very disruptive to commerce. So, I do hope that the parties stay at the table and resolve it as quickly as possible, hopefully averting a strike, but certainly, keeping the length of the strike as short as possible. The knock-on effects through the supply chain become quite extensive.” Quick then asked, “Where are the issues most prominent, where have you been kind of focused and hearing on what would happen if the strike goes, let’s say, longer than a week?” Raimondo answered, “I have not been very focused on that. I would refer you to the White House or the transportation secretary.” Quick then asked, “I know the administration and the president himself have said that he is not going to push the two sides together, he’s urged them to talk. And I just wonder, have you heard from business leaders — you probably are the person in the administration who has business leaders’ ear more than just about anybody else — in terms of what this might mean for them?” Raimondo responded, “I want to stay in the bounds of the Hatch Act here. So, if you wanted to have me back as Commerce Secretary later in the week, maybe we could talk about that. But, as I said, I haven’t been particularly involved.” Follow Ian Hanchett on Twitter @IanHanchett",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "commerce",
        "Gina Raimondo",
        "Joe Biden",
        "ports",
        "strike",
        "secy",
        "involved",
        "port",
        "Raimondo",
        "Quick",
        "disruptive"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/florida-poll-support-abortion-amendment-falls-short-many-voters-undecided/",
      "title": "Florida Poll: Support for Abortion Amendment Falls Short, but Many Voters Are Undecided",
      "author": "Katherine Hamilton",
      "content": "New polling out of Florida shows a proposed abortion amendment falling short of the support needed for passage — but many voters are still unsure how they will vote. The survey, reported on by Florida Politics and conducted by a Republican-led firm called Victory Insights, found that 49.7 percent of respondents support the abortion amendment, which falls short of the 60 percent support needed to pass. Another 29. 2 percent oppose the amendment, and 21.2 percent are undecided. “It’s important to note that more than 1 in 5 voters remain undecided, providing ample opportunity for the amendment to pick up another (about) 10 percent support in order to reach the threshold,” senior pollster Ben Galbraith said in a polling memo obtained by the outlet. Amendment 4 bars the state from restricting abortion before viability (approximately 24 weeks) or later in pregnancy “when necessary to protect the patient’s health, as determined by the patient’s healthcare provider.” It reads: No law shall prohibit, penalize, delay, or restrict abortion before viability or when necessary to protect the patient’s health, as determined by the patient’s healthcare provider. This amendment does not change the Legislature’s constitutional authority to require notification to a parent or guardian before a minor has an abortion. If Florida voters pass the measure with at least 60 percent support in November, the abortion amendment would undo the state’s six-week limit and basically create a permanent right to abortion in the state that could only be undone with another ballot measure or an uphill legal battle. RELATED: Ten States Will Have Abortion on the Ballot in November By political affiliation, 48 percent of Republicans polled say they plan to vote against the measure, while 29 percent are undecided, and 23 percent plan to vote in favor of it, the survey found. Unaffiliated voters and Democrats show far more support for the measure. Nearly 6 in 10 (57 percent) of unaffiliated voters in the Sunshine State plan to vote for the measure, while 24 percent are undecided, and 19 percent plan to vote against it. Seventy-six percent of Democrats plan to support the measure, while 12 percent are undecided, and 13 percent plan to vote against it, the survey found. By age group, adults ages 18 to 49 are more supportive (55 percent) of the amendment than 50- to 64-year-olds (49 percent), and those 65 and up (45 percent). Various polls within the past few months have shown the amendment narrowly failing or passing, often within the margin of error (see here, here, here, here, here, here, and here). The Republican Party of Florida has formally opposed the amendment, arguing that Amendment 4, along with Amendment 3 related to recreational marijuana, are too extreme for the state. Party Chairman Evan Power said: Floridians are confident that their legislature has been passing laws that reflect the priorities of our state. Amendments 3 and 4 are unnecessary attempts by an increasingly shrinking minority who know the only way to win support for their radical agenda is to confuse and mislead the electorate. In addition, the Republican Party of Florida supports the legislature’s desire to make school board races partisan, create a constitutional right to hunt and fish, and eliminate the taxpayer burden of public campaign financing. The Florida Democrats are a dead carcass on the side of the road, but outside dark money groups are looking to promote their far-left ideology by attempting to confuse Florida voters. The Florida GOP stands ready to correct the record and defeat the radical left while enshrining in our Constitution more rights for our citizens. The Florida Agency for Health Care Administration (AHCA) has also come out against the amendment, saying it “threatens women’s safety.” The AHCA warned that the measure’s vague language could lead to the overturning of at least 20 abortion-related laws, including parental consent, if it is passed. Florida Gov. Ron DeSantis (R) has also spoken out against the abortion amendment and said it was “written in a way that’s intentionally designed to deceive voters.” The poll was conducted Sept. 22-25, 2024, among 600 likely general election voters throughout Florida. The margin of error is ±4.4 percentage points. Katherine Hamilton is a political reporter for Breitbart News. You can follow her on X @thekat_hamilton.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Abortion",
        "ballot initiatives",
        "Ballot Measure",
        "Florida",
        "unborn babies",
        "support",
        "amendment",
        "short",
        "voters",
        "percent",
        "Abortion amendment"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/local/2024/09/30/maritime-historians-elusive-lake-michigan-shipwreck-130-years/",
      "title": "Maritime Historians Find ‘Elusive’ Lake Michigan Shipwreck After Nearly 130 Years",
      "author": "Olivia Rondeau",
      "content": "An “elusive” tugboat that sank in Lake Michigan nearly 130 years ago has finally been found by maritime historians who set out on a three-day-mission to solve the mystery of where it went. The John Evenson, a 54-foot, ten-year-old wood steam tugboat went unseen from its demise on June 5, 1895, until September 13, USA Today reported. Named after the captain of Milwaukee, Illinois’, U.S. Life-Saving Service Station in the 1870s and ’80s who died at a young age, the John Evenson was assisting another vessel, the I. Watson Stephenson, when it went under. “The Evenson’s captain ran across the bow of the much larger Stephenson, which struck the tug, capsizing her and sending her immediately to the bottom,” wrote historian Brendon Baillod in a recent report on his findings. “The tug’s five crew were cast into the water and rescued except for the tug’s fireman, Martin Boswell, who was working below deck and was carried down with the vessel and lost.” Several attempts to find the lost boat over the years proved unsuccessful, with a local dive club even offering a $500 reward for it at one point, according to USA Today. What was meant to be a multi-day affair was cut short after a “deliberate search using historical records and remote sensing technology” led Baillod and fellow Wisconsin Underwater Archeology Association historian Bob Jaeck to finally locate the boat. The pair found the Evenson while tuning their sonar equipment when a “huge boiler crawled across the screen” after just five minutes, Baillod wrote. The historians then deployed a remote operated vehicle (ROV) to observe the sunken ship’s “giant propeller, steam engine and boiler.” “The tug’s hull-bed is present along with all of her machinery, giving a fascinating look at the steam technology of the late 1800s,” Baillod said of the wreckage, which was found off the Wisconsin coast near Algoma. Another maritime historian, Tamara Thomsen, and diver Zach Whitrock arrived at the scene the next day to see the boat. “A 3D photogrammetry model was created by capturing over 2000 high resolution images, recording the site in detail. Plans for the site include nominating it to the National Register of Historic Places and making it available for sport divers to visit,” said Baillod. The Evenson’s discovery makes for the third significant shipwreck found by Baillod and Jaeck in the last two years, as they found the sunken schooners Trinidad and the Margaret A. Muir around the same area of Lake Michigan. Even with their recent successes in finding other shipwrecks, Baillod and Jaeck said they turned to each other “gobsmacked” when they found the “elusive” Evenson. “It was almost like the wreck wanted to be found,” Baillod told USA Today. “It never gets old,” he added. “It’s always exciting.”",
      "genre": "local",
      "date": "30-09-2024",
      "keywords": [
        "boats",
        "historian",
        "Lake Michigan",
        "shipwreck",
        "Wisconsin",
        "maritime",
        "Lake",
        "historians",
        "Michigan",
        "elusive",
        "Baillod",
        "Evenson",
        "tugs",
        "boat",
        "USA"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/kamala-harris-supports-no-jail-time-smoking-weed-despite-jailing-nearly-2000-people-marijuana-offenses/",
      "title": "Kamala Harris Supports No Jail Time ‘for Smoking Weed’ Despite Jailing Nearly 2,000 People for Marijuana Offenses",
      "author": "Elizabeth Weibel",
      "content": "Vice President Kamala Harris expressed support for marijuana legalization, noting that “people should not be” jailed “for smoking weed,” despite her record of having overseen nearly 2,000 convictions for marijuana-related offenses. During an interview with All The Smoke podcast, when asked about her views on cannabis, Harris expressed that it was time to legalize marijuana and that they needed to “stop criminalizing” smoking weed. “I just feel strongly, people should not be going to jail for smoking weed,” Harris said. “And, we know historically what that has meant and who has gone to jail.” “Second, I just think we have come to a point where we have to understand that we need to legalize it and stop criminalizing this behavior,” Harris added. “And so, I’ve actually… this is not a new position for me. I have felt for a long time we need to legalize it, so that’s where I am on that.” As Breitbart News has reported, Harris stated during a roundtable event in March that she believes “nobody should have to go to jail for smoking weed.” Harris and President Joe Biden have also made statements in posts on X that “no one should go to jail for smoking weed,” after the Department of Justice took steps to reclassify marijuana from a Schedule I drug to a Schedule III drug. The support from Harris to legalize marijuana comes after she had overseen almost 2,000 convictions for marijuana-related offenses while she served as the district attorney of San Francisco, according to data obtained by the Bay Area News Group, Mercury News reported in 2019. Harris was criticized by former Rep. Tulsi Gabbard (I-HI) regarding her prosecutorial record during a Democratic primary debate in 2019. During the debate, Gabbard stated that Harris “put over 1,500 people in jail for marijuana violations,” referencing numbers from an article by the Washington Free Beacon, which used data from the time that Harris served as the attorney general of California, according to the Mercury News: During the last presidential debate in July, Rep. Tulsi Gabbard blasted Harris over marijuana convictions, saying she “put over 1,500 people in jail for marijuana violations and then laughed about it when she was asked if she ever smoked marijuana.” Gabbard was misleadingly citing figures for all of California while Harris was attorney general — even though the vast majority of marijuana cases in the state are prosecuted by independently elected county district attorneys. As San Francisco DA from 2004 through 2010, however, Harris had wide latitude to decide which marijuana cases to prosecute and what sentences to seek in the city. “Over Harris’ seven years as top prosecutor, her attorneys won 1,956 misdemeanor and felony convictions for marijuana possession, cultivation, or sale, according to data from the DA’s office,” the outlet reported. “That includes people who were convicted of marijuana offenses and more serious crimes at the same time.”",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Kamala Harris",
        "law and order",
        "Marijuana",
        "podcast",
        "Tulsi Gabbard",
        "Harris",
        "smoking",
        "weed",
        "people",
        "jail",
        "legalize"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/faith/2024/09/30/hurricane-relief-franklin-graham-encourages-victims-prays-donald-trump-strengthen-him-protect-him/",
      "title": "Hurricane Relief — Franklin Graham Encourages Victims and Prays for Donald Trump: ‘Strengthen Him, Protect Him’",
      "author": "Hannah Knudsen",
      "content": "Christian Evangelist Franklin Graham, President of Samaritan’s Purse, offered encouragement for the victims devastated by the aftermath of Hurricane Helene, as well as a prayer for former President Donald Trump, as he and others gathered in Valdosta, Georgia, to deliver relief items to those affected by the massive storm. “We came down with truckloads of things, and we’re going to have that done by Franklin’s incredible organization. They’ve done such a good job,” Trump said. “We’ve done this before, but we have a lot of truckloads of different items — from oil to water to all sorts of equipment that’s going to help them,” Trump continued, delivering remarks and making it clear that they are there to “stand in complete solidarity with the people of Georgia and with all of those suffering in the terrible aftermath of Hurricane Helene.” “Hurricane Helene turned out to be a big one — like just about the biggest that anyone’s seen,” Trump said. “Valdosta has been ravaged. The town is very, very badly hurting, and many thousands are without power. They’re running low on food and fuel. We brought a lot of it down with us. It’s going to be distributed now or soon, throughout Georgia as well as North Carolina, South Carolina, Florida, Virginia, Alabama and Tennessee,” Trump continued. RELATED — “Completely Gone”: Flooding from Hurricane Helene Devastates North Carolina Town Trump asked Graham to speak. Graham said the wrecked building behind him “represents hundreds of thousands of people that have lost homes, businesses, friends, loved ones, and it’s going to take an army of volunteers and people to respond.” “And of course, at Samaritan’s Purse, we want to respond always in Jesus’s name, and we want people to know that God loves them, that God cares for them,” Graham emphasized. “Sometimes, when a storm like this comes, people think, ‘Well, maybe God is mad at us. Maybe this is his judgment,'” he said, making it clear that it is not the case. “No, God loves us. How do I know that? Because our Bible tells us that God loves us and cares for us,” he said. “And yes, there are storms in life, but God will take us through those storms, if we put our faith and trust in His Son, Jesus Christ.” RELATED — Donald Trump Leads Moment of Silence for Lives Lost from Hurricane Helene Graham then led everyone in a prayer, thanking the Lord for the men and women volunteering to help those in need to recover. “Thank you for the President, who has taken time to come and to see it for himself, to shake hands, to encourage and to smile on the faces of people that have been hurt and devastated by this storm,” Graham prayed. “Father, we ask for help. Father, we pray that, as we come to this election, that your will be done. And so Father, we pray for the President: Strengthen him. Protect him. Father, we thank you, and it’s in Jesus’ name we pray this prayer. Amen,” he added. WATCH: The remarks came as Trump visited Georgia in the aftermath of Hurricane Helene, which resulted in hundreds of thousands losing their possessions and at least 116 losing their lives.",
      "genre": "faith",
      "date": "30-09-2024",
      "keywords": [
        "2024 Presidential Election",
        "Donald Trump",
        "Franklin Graham",
        "Georgia",
        "Hurricane Helene",
        "hurricane",
        "Graham",
        "Franklin",
        "victims",
        "Evangelist",
        "Trump",
        "Helene",
        "God"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/nasrallah-in-2000-the-jews-invented-the-legend-of-nazi-atrocities/",
      "title": "Nasrallah in 2000: ‘The Jews Invented the Legend of Nazi Atrocities’",
      "author": "Joel B. Pollak",
      "content": "Hassan Nasrallah, the terrorist leader of Hezbollah who was killed by the Israel Defense Forces (IDF) in an airstrike on Friday, was a radical Islamist, antisemite, and Holocaust denier who wanted to destroy Israel and to expel the Jews. The reality of his beliefs stands in contrast to the almost laudatory way in which some media outlets presented him. His most infamous quote is: “If Jews all gather in Israel, it will save us the trouble of going after them worldwide.” That statement from 2001 was reported in the New York Times in 2004, but only from a secondary source. What is clear is that Nasrallah hated Jews and, at best, wanted to expel them from Israel to other countries. In 2000, he delivered a speech at a Shiite Muslim ceremony in which he said (via Israel’s Ministry of Foreign Affairs): The Jews invented the legend of the Nazi atrocities. It is clear that the numbers they talk about are greatly exaggerated. They can speak of fabricated or exaggerated massacres that occurred during the Second World War, but we must forget the massacres that they committed against us and the peoples of the region which are documented and proven… The only way to achieve just and comprehensive peace is not through the implementation of [United Nations Security Council] resolutions 425, 242 and 338 but by restoring all the Arab lands to their sons and owners, without war and conflict. Let us spare bloodshed. Let the Yemenite Jews return to Yemen, the Moroccan Jews to Morocco, the Ethiopian Jews to Ethiopia, the European Jews to Europe, and the American Jews to America. The Palestinian people will get their land back and establish their state… Anyone who reads the Koran and the holy writings of the monotheistic religions sees what they did to the prophets, and what acts of madness and slaughter the Jews carried out throughout history… Anyone who reads these texts cannot think of co-existence with them, of peace with them, or about accepting their presence, not only in Palestine of 1948 but even in a small village in Palestine, because they are a cancer which is liable to spread again at any moment… Hezbollah also targeted a Jewish community center in a devastating bombing in Buenos Aires, Argentina, in 1994, two years after Nasrallah had become the leader of the terrorist organization in 1993. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "Hassan Nasrallah",
        "Hezbollah",
        "Israel",
        "Israel Defense Forces (IDF)",
        "Lebanon",
        "Nasrallah",
        "Jews",
        "destroy"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/entertainment/2024/09/30/movie-armorers-conviction-upheld-in-fatal-rust-set-shooting-by-alec-baldwin/",
      "title": "Movie Armorer’s Conviction Upheld in Fatal ‘Rust’ Set Shooting by Alec Baldwin",
      "author": "Breitbart News",
      "content": "SANTA FE, N.M. (AP) — A New Mexico judge on Monday upheld an involuntary manslaughter conviction against a movie armorer in the fatal shooting of a cinematographer by Alec Baldwin on the set of the Western film “Rust.” Armorer Hannah Gutierrez-Reed asked a court to dismiss her involuntary manslaughter conviction or convene a new trial in the shooting death, alleging misconduct and suppression of evidence by law enforcement. Judge Mary Marlowe Sommer halted and ended Baldwin’s trial in July based on misconduct of police and prosecutors and their withholding evidence from the defense in the 2021 shooting of cinematographer Halyna Hutchins on the set outside Santa Fe. Gutierrez-Reed was convicted by a jury in March in a trial overseen by Marlowe Sommer, who later sentenced her to the maximum 18-month penalty. Gutierrez-Reed already has an appeal of her involuntary manslaughter conviction pending in a higher court. Prosecutors blamed Gutierrez-Reed for unwittingly bringing live ammunition onto the set of “Rust” and for failing to follow basic gun safety protocols. Gutierrez-Reed’s attorneys argued that her case should be reconsidered because prosecutors failed to share evidence that might have been exculpatory. She was acquitted at trial of allegations she tampered with evidence in the “Rust” investigation. Gutierrez-Reed also has pleaded not guilty to a separate felony charge that she allegedly carried a gun into a bar in Santa Fe, New Mexico, where firearms are prohibited. A proposed plea agreement is awaiting court review. Baldwin, the lead actor and co-producer for “Rust,” was pointing a gun at Hutchins during a rehearsal on a movie set outside Santa Fe in October 2021 when the revolver went off, killing Hutchins and wounding director Joel Souza.",
      "genre": "entertainment",
      "date": "30-09-2024",
      "keywords": [
        "Alec Baldwin",
        "Hannah Gutierrez-Reed",
        "Rust",
        "movie",
        "set",
        "Baldwin",
        "Alec",
        "shooting",
        "Gutierrez",
        "Reed",
        "evidence"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/report-senate-democrats-nuking-filibuster-abortion-worth-risk/",
      "title": "Report: Senate Democrats Say Nuking Filibuster over Abortion Is Worth the Risk",
      "author": "Katherine Hamilton",
      "content": "Several Senate Democrats are joining Democratic presidential nominee Vice President Kamala Harris in her call to end the filibuster in order to pass legislation that would federalize abortion and wipe out pro-life state laws. Nuking the filibuster would drop the 60 required votes to pass legislation in the U.S. Senate to just 51 votes, a move some Democrats told the Hill may be “worth the risk” should they maintain control of the Senate and gain control of the House and presidency in 2025. While some Senate Democrats are wary of what Republicans could achieve without the filibuster if they were to eventually gain back control, they said lowering the threshold would enable the codification of “abortion rights” and “other key legislative priorities,” the report published on Sunday states. “There’s real risk anytime there’s debate about rules and procedures in the Senate. It becomes very bitter,” Sen. Peter Welch (D-VT) told the outlet. “So yes, there is risk.” “The other problem is there’s risk in having a Senate that’s more dedicated to rules and procedures than it is to getting things done,” Welch continued. “It’s very dangerous for the Senate as an institution to simply not address extraordinarily important issues like reproductive freedom, like voting rights.” Senate Majority Whip Dick Durbin (D-IL) agreed on potential long-term problems with scrapping the filibuster but emphasized that Democrats have no choice because the current setup is hampering their ability to enact their agenda. “As far as I’m concerned, we should be discussing the rules going forward. We’re now in a dystopian situation in the Senate where we do very little, if any, legislating,” Durbin said. Vice President Harris brought the filibuster debate to the forefront again after she called for its end during an appearance on Wisconsin Public Radio on last week to supposedly restore Roe v. Wade. “I think we should eliminate the filibuster for Roe,” Harris said. “To actually put back in law the protections for reproductive freedom and for the ability of every person and every woman to make decisions about their own body and not have their government tell them what to do.” Her call to end the filibuster is the furthest she has gone in her pledge to federalize abortion if she is elected in November. Harris has repeatedly said she would sign legislation to restore Roe v. Wade, which the Supreme Court overturned in 2022, and has made killing unborn babies in abortions central to her campaign. She has repeatedly refused to cite abortion restrictions she would support and falsely claimed that abortions do not happen later in pregnancy. Harris has previously called to end the filibuster but for a different reason. During her 2020 presidential campaign, she said she would back ending the filibuster to pass the radical Green New Deal, which is essentially a far-left socialist wishlist. National Republican Senatorial Committee (NRSC) Chairman Steve Daines (R-MT) warned in an exclusive interview with Breitbart News in July that the Democrats have “radical” power-grabbing plans for the United States, which include ending the filibuster if they hold the majority in the upper chamber of Congress. Daines specifically warned that ending the filibuster would allow Democrats to ram through their radical agenda, including packing the U.S. Supreme Court to 13 justices instead of nine, making Washington, DC, and Puerto Rico states to add four Democrat U.S. senators to the Senate, and conducting a federal takeover of election operations everywhere in the country. “The consequences of losing right now are profound because, if we don’t take back the majority and the Democrats are in charge, they will blow up the filibuster,” Daines told Breitbart News D.C. Bureau Chief Matthew Boyle. Daines continued: That means D.C. and Puerto Rico are now states. That means four Democrat senators in perpetuity. They will also move the Supreme Court from nine to 13 Justices. They will pack the court. And last, they will pass one of their favorite bills — the left — and that’s the federal takeover of all the elections. Our Founding Fathers feared concentration of power. That’s one of the things about the separation of powers both in terms of the three branches of government but also the separation of powers between the federal government and the states, the principles of federalism. This bill would remove any voter ID laws that states have passed. It would be all mail-in ballots. They would have cutoffs on Tuesday night on election night at maybe 8:00 p.m. and have a long tail of maybe two weeks to get all the ballots in. You can see, we lose complete control of elections, and the left does irreparable harm to this country with a power grab that would make it very difficult to ever get a center-right government elected in Washington again. As Boyle reported, the only thing that stopped Democrats from ending the filibuster in the last two Congresses is that two senators, who now claim to be independents and have since left the Democratic Party, refused to go along with this strategy. He wrote: Those two senators, Sens. Kyrsten Sinema of Arizona and Joe Manchin of West Virginia, are both not running for reelection this cycle. Despite leaving the Democrat Party, they did not join the Republicans and still caucus with Democrats. But, since both are leaving the U.S. Senate, Daines warns that if Democrats hold the majority, there will be no dissenting voices left inside the Democrat Party to stop them from going through with their radical power grab plans. Daines points to a written plan from Rep. Adam Schiff (D-CA), the Democrat candidate for U.S. Senate in California this year, who explicitly made these goals clear in what Schiff calls the interest of protecting “democracy.” Daines said that since Sinema and Manchin have both announced their retirements, “there are no more Democrats that are going to stand to protect the filibuster.” “…[W]hich means it’s a simple 50-vote-plus-one threshold to put these radical changes into our laws, including — imagine the Second Amendment and the gun-grabbing legislation they would pass with just 51 votes,” Daines said. “By the way, don’t believe me: Go read what Adam Schiff has written. It’s a sad report, but Adam Schiff is probably going to be the next U.S. senator from California,” he continued. “He telegraphed this in writing earlier this year. So, that’s their strategy. We cannot let them succeed, and that’s why we have to get at least 51 Republicans in the United States Senate in January of 2025.” Democrats’ path to power is not so clean cut, the Hill reported, noting that its forecast with Decision Desk HQ shows Republicans having a 70 percent chance of winning back the Senate majority. Even so, many are encouraged by the fact that Sens. Sinema and Manchin will not be there to thwart their goal of altering the filibuster, the report reads. “We would have Roe v. Wade as law of the land, comprehensive immigration reform, better gun safety laws,” said Sen. Elizabeth Warren (D-MA). “And we’d just be warming up.”",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "2024 election",
        "2024 Presidential Election",
        "Abortion",
        "Filibuster",
        "Green New Deal",
        "Kamala Harris",
        "Senate Democrats",
        "The Hill",
        "U.S. Senate",
        "Democrats",
        "Senate",
        "report",
        "Daines",
        "Democrat"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/economy/2024/09/30/powell-touts-strong-economy-even-while-indicating-more-rate-cuts-ahead/",
      "title": "Powell Touts Strong Economy Even While Indicating More Rate Cuts Ahead",
      "author": "John Carney",
      "content": "Federal Reserve Chair Jerome Powell reaffirmed on Monday that he views the U.S. economy as fundamentally strong, even as the central bank made a surprising move to cut interest rates earlier this month. Speaking at the annual meeting of the National Association for Business Economics in Nashville, Powell sought to explain the Fed’s decision to lower rates while expressing confidence in the economy’s resilience. “We have made a good deal of progress toward our goal of reducing inflation without a painful rise in unemployment,” Powell said, signaling that the Fed remains committed to what economists often call a “soft landing” for the economy. The rate cut, a half-point reduction that brought the Fed’s policy rate to a range of 4.75 to 5 percent, was unexpected given the Fed’s repeated assertions of economic strength. Powell portrayed the move as a calculated effort to maintain momentum in the labor market while continuing to bring inflation down toward the central bank’s target of 2 percent. Still, the decision has raised questions about the Fed’s strategy, particularly as Powell himself acknowledged the underlying robustness of the economy. The divergence between the Fed’s rhetoric of strength and its actions of easing monetary policy has left some market participants and analysts wondering whether the central bank is responding to concerns not yet fully visible in the data. While Powell sidestepped specific questions about whether future rate cuts would be 25 or 50 basis points, he emphasized that decisions would be made “meeting by meeting,” allowing the Fed flexibility to react to changing economic conditions. The central bank is aiming to bring rates down to a “neutral” level—estimated around 3 percent—where monetary policy neither stimulates nor restricts growth. At present, the Fed views its policy rate as still somewhat restrictive, dampening economic demand. Yet some economists point to the resilience of financial markets—marked by five straight months of gains in the S&P 500 and Dow Jones Industrial Average—as evidence that the economy may not be as vulnerable as the Fed suggests. In the coming weeks, markets will be focused on upcoming jobs reports, which Powell indicated would play a crucial role in shaping the Fed’s next moves. Stronger-than-expected job growth could lead to a smaller 25-basis-point rate cut, while weaker labor data might push the Fed to take more aggressive action, with another 50-basis-point reduction. The balancing act the Fed faces—cutting rates while signaling confidence in economic growth—reflects the challenge of managing an economy that has thus far defied expectations. Powell’s optimism on Monday, juxtaposed with the Fed’s latest moves, leaves open the question of whether the central bank is anticipating a slowdown that has yet to materialize",
      "genre": "economy",
      "date": "30-09-2024",
      "keywords": [
        "powell",
        "Indicating",
        "highly",
        "policy",
        "monetary",
        "Feds",
        "Fed",
        "economy",
        "rate",
        "Jerome Powell"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/reports-israel-shells-hezbollah-positions-lebanese-united-nations-troops-pull-back/",
      "title": "Reports: Israel Shells Hezbollah Positions; Lebanese, United Nations Troops Pull Back",
      "author": "Joel B. Pollak",
      "content": "The Lebanese Armed Forces (LAF) and the United Nations Interim Force in Lebanon (UNIFIL) reportedly pulled back from Lebanon’s border with Israel, as Israel began shelling Hezbollah positions ahead of a ground assault on Monday night. As Breitbart News reported, citing other media reports, Israel had informed the U.S. of its plans for a “limited” ground operation in Lebanon to remove Hezbollah outposts. Reports circulated Monday that the LAF and UNIFIL had withdrawn. The Agence France-Presse (AFP) reported that the LAF had begun repositioning its forces in response to information about Israeli troop movements from the U.S. There were also unconfirmed reports that UNIFIL, which is meant to enforce United Nations Security Council resolutions against Hezbollah’s presence near the border, but has failed to do so, also withdrew from some positions. The Times of Israel reported that there was “heavy” Israeli shelling reported near a Lebanese border town. The Israel Defense Forces (IDF) declared the area around Israel’s northernmost border communities to be a closed military zone. The Israel Defense Forces declared the area around Metula, Kfar Giladi, and Misgav Am to be a closed military zone as of Sep. 30, 2024. Geographic place names are indicated in Hebrew. (IDF) White House Press Secretary Karine Jean-Pierre told reporters on Monday afternoon that the Biden administration understood that Israel’s strategic purpose was “to make sure that Hezbollah cannot maintain the capacity to attack Israeli communities from the immediate opposite side of the border.” She reiterated President Joe Biden’s call for a ceasefire. Update: The IDF’s Arabic spokesperson, Avihay Adraee, posted maps of buildings in Beirut, Lebanon’s capital city, that he said local residents should avoid: IDF Spokesman Rear Admiral Daniel Hagari asked Israelis not to share reports about troop movements and to await official reports: Update: UNIFIL later denied that it was repositioning in response to Israel’s entry on the ground in Lebanon. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak. This post has been updated.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "Hezbollah",
        "Israel",
        "Israel Defense Forces (IDF)",
        "Lebanon",
        "UNIFIL",
        "United",
        "Lebanese",
        "border",
        "reports"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/crime/2024/09/30/dead-baby-discovered-in-bathroom-manhattan-restaurant/",
      "title": "Dead Baby Discovered in Bathroom of Manhattan Restaurant",
      "author": "Katherine Hamilton",
      "content": "A dead baby was discovered in the bathroom of a restaurant in Manhattan on Monday morning, police sources told the New York Post. The infant — whose age and sex are not immediately known or have not been released — was found “just before 10 a.m. inside the restroom at Sophie’s Cuban Cuisine,” law enforcement and sources said. The eatery is located in Manhattan’s Financial District, on Fulton Street near Gold Street downtown. Police responded to a 911 call, and when they arrived, they found the baby unresponsive and unconscious, authorities said. EMS workers pronounced the baby dead at the scene, according to the report. The baby’s death is under investigation, and it is not currently known if criminality is suspected. No arrests had been made as of Monday afternoon, the report states.",
      "genre": "crime",
      "date": "30-09-2024",
      "keywords": [
        "baby",
        "child deaths",
        "first responders",
        "investigation",
        "Manhattan",
        "New York City",
        "dead",
        "discovered",
        "bathroom",
        "restaurant"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/health/2024/09/30/video-father-walks-nearly-30-miles-through-flood-hazards-attend-daughters-wedding/",
      "title": "VIDEO: Father Walks Nearly 30 Miles Through Flood Hazards to Attend Daughter’s Wedding",
      "author": "Amy Furr",
      "content": "One father’s love for his child shone brightly during his arduous journey through areas devastated in the aftermath of Hurricane Helene. When David Jones set out on a two-hour drive from South Carolina to Johnson City, Tennessee, for his daughter’s wedding, he was determined to get there, WJHL reported Monday. His journey ended up being seven hours in his car and over five hours on foot. Jones crossed the Tennessee state line around 2:00 a.m. and learned the roads were impassable. But his daughter’s wedding was at 11:00 a.m. and he was going to walk her down the aisle, no matter what lay ahead. Therefore, he decided to walk the approximately 30 miles to his destination. The hurricane that hit Florida on Thursday was deemed a Category 4 storm and was later downgraded as it moved over the southeast United States, Breitbart News reported on Monday. The storm knocked out power, washed bridges away, and stranded people with floodwaters. Jones had to walk in complete darkness carrying only his cellphone as a light while picking his way around hazards such as mud, huge piles of debris, broken fences, and downed trees. At one point, he got stuck in mud and was nearly hit by a backhoe as it was clearing a road but managed to escape in time. For extra safety, he carried a reflective stake so cars would avoid hitting him. Jones eventually got help from a driver he knew who drove him the final few miles to his daughter’s wedding. An image shows the pair on her wedding day: “That’s so emotionally moving [to know] that my dad loves me that much, that he’ll come and go through all of that to get to my wedding and be there on time,” said Elizabeth Marquez, who had no idea about her father’s journey until later. Jones later gave the newlyweds a special gift. “I brought the reflector to the reception, and I presented it to Elizabeth, my daughter, and Daniel just for them to remember, to be a protector and a good reflection of each other and a reflection of God,” he said. As cleanup continues, stories have emerged of heroic Americans who have endured the storm. In Tennessee, people living near the Nolichucky River recently cleared a bridge to rescue others trapped by floodwaters, according to Breitbart News.",
      "genre": "health",
      "date": "30-09-2024",
      "keywords": [
        "B Inspired News",
        "Daughter",
        "Father",
        "flood",
        "hurricane",
        "Hurricane Helene",
        "South Carolina",
        "Tennessee",
        "wedding",
        "video",
        "aftermath",
        "devastated",
        "Jones",
        "storm",
        "Daughter's Wedding"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/tim-walz-bragged-mass-immigration-overwhelming-small-minnesota-towns-schools-50-languages-beautiful-diversity/",
      "title": "Tim Walz Bragged of Mass Immigration Overwhelming Small Minnesota Town’s Schools with 50 Languages: ‘Beautiful Diversity’",
      "author": "John Binder",
      "content": "Gov. Tim Walz (D), Vice President Kamala Harris’s running mate, once bragged about mass immigration overwhelming a small town in southern Minnesota — calling the situation an example of “beautiful diversity.” In late 2019, Breitbart News reported extensively on Worthington, Minnesota. With fewer than 14,000 residents, the town’s taxpayers were forced to hike taxes to the sum of tens of millions to expand the school district because of a rapid increase in migrant children enrolling. Much of that mass immigration in Worthington is the result of the federal government’s Unaccompanied Alien Children (UAC) program and the fact that a JBS Pork slaughterhouse attracts newly arrived migrants to the area. During a gubernatorial debate in October 2022, Walz bragged about the mass immigration that has inundated Worthington for decades now — spinning it as a positive thing that several dozen languages are now spoken in the town’s schools. “We are a state of immigrants that values that. We have more refugees per capita than any other state. That’s not just morally a good thing — it’s our economic and cultural future,” Walz said: This beautiful diversity we see out in Worthington when I’m there, you see 50 languages spoken in the school and you see every storefront filled with different types of foods, different types of businesses that are happening. Minnesota needs to continue to do that. The Office of Governor can set the tone on that. [Emphasis added] Worthington, since the year 2000, has seen its foreign-born population balloon to almost 30 percent of the town’s population. About 24 years ago, the town’s foreign-born population was half what it is today. Minnesota is one of several states spending billions to teach American English to newly arrived migrant children enrolled in its school districts. With more than 75,000 English learners, Minnesota taxpayers paid nearly $1.2 billion to fund its English as a Second Language (ESL) program in 2020. In June, a statewide look at Minnesota’s public schools revealed alarming trends. From 2019 to 2022, the percentage of fourth graders in the state who are not proficient in reading has increased from 62 percent to almost 70 percent. Likewise, eighth graders not proficient in math increased from 56 percent in 2019 to nearly 70 percent in 2022. Perhaps most alarming, almost a third of all students in the state were deemed “chronically absent” in the 2021-2022 school year, meaning they missed 10 percent or more school days. John Binder is a reporter for Breitbart News. Email him at jbinder@breitbart.com. Follow him on Twitter here.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Education",
        "mass immigration",
        "Minnesota",
        "public schools",
        "Tim Walz",
        "Tim",
        "bragged",
        "mass",
        "immigration",
        "overwhelming",
        "percent",
        "Worthington",
        "town",
        "school"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/entertainment/2024/09/30/watch-man-in-texas-wins-guitar-signed-by-taylor-swift-at-charity-auction-then-smashes-it-to-pieces/",
      "title": "Watch: Man in Texas Wins Guitar Signed by Taylor Swift at Charity Auction, Then Smashes It to Pieces",
      "author": "Warner Todd Huston",
      "content": "A man who won a guitar signed by Taylor Swift at a Texas charity event smashed the instrument to pieces right on stage after winning the item and the video of his gleeful act has gone viral. The video appears to have been recorded at the Ellis County Wild Game Dinner held near Dallas, Texas, over the weekend and the guitar was certified as having being signed by the pop mega star, TMZ reported. The video starts with the emcee holding a hammer in one hand and the guitar on another as the man assumed to be the winner of the auction comes to collect his prize. But as he approaches, he grabs both the hammer and the guitar and instantly starts bashing the guitar to pieces as the crowd laughs and cheers. Since the emcee already had the hammer ready for action, it is obvious that the whole point of the auction was to destroy the Taylor Swift item. According to TMZ, the guitar was donated to the charity auction by a third party, not Swift herself. The Ellis County Wild Game Dinner is a non-profit organization that supports agricultural education for kids. Swift has been a particular target of criticism from the political right for years, but especially after her endorsement of Kamala Harris for president. Follow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, or Truth Social @WarnerToddHuston",
      "genre": "entertainment",
      "date": "30-09-2024",
      "keywords": [
        "Taylor Swift",
        "Taylor",
        "charity",
        "Texas",
        "pieces",
        "Swift",
        "guitar",
        "video",
        "hammer",
        "auction"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/health/2024/09/30/utah-mom-fundraises-own-funeral-after-rare-cancer-diagnosis/",
      "title": "Utah Mom Fundraises for Her Own Funeral After Rare Cancer Diagnosis",
      "author": "Olivia Rondeau",
      "content": "A Utah mom has been forced to fundraise to plan her own funeral and support her two young children after being diagnosed with a rare, aggressive form of cancer. Erika Diarte-Carr, a 33-year-old single mother to Jeremiah, 7, and Aaliyah, 5, made a desperate plea on GoFundMe to raise $5,000 after receiving bad news from her doctor: On May 7th, 2022, the day before Mother’s Day, I walked into the emergency room due to what I thought to be just a normal shoulder injury and walked out diagnosed with stage 4 terminal cancer along with the doctor’s words replaying in my head, “I hope you have a good support system at home because you’re going to need it, you have a long and hard journey ahead of you.” The doctor then proceeded to tell me that there were multiple tumors that had metastasized to other parts of my body including my skeletal, which is how we were able to find the tumor that was causing my shoulder pain. By that point the damage had already been done. In that moment, mine and my kids’ entire lives had changed forever, as well as all of those around us. On top of her shock diagnosis with stage 4 small cell lung carcinoma, Diarte-Carr also found out she had Cushing Syndrome in January 2024 —- which led to several other issues like dramatic weight gain, swelling, deterioration of her muscles and bones, diabetes, and “so much more!” After receiving her diagnosis, the hardworking mom still managed to maintain a full-time job and parent her children. “I do have an AMAZING support system but over time it has put a major financial, emotional, mental and physical toll on us all,” she noted. As if she was not already going through enough hardship, a September 18 update from her oncologist revealed that the situation was even more dire than previously thought. “Due to my prognosis, I have decided to discontinue treatments as they will no longer help. I have been given 3 months to live. 3 months to spend with my babies and loved ones. 3 months to make the best of what time I have left,” Diarte-Carr wrote in an update on GoFundMe. “During these next couple of months I need to make sure my kids will be ok after I am gone. I am faced now with the most difficult thing of planning my own funeral.” As her condition worsened she eventually had to stop working, and found herself in a financial pit. “I do not have any finances saved up or any life insurance set aside for this situation,” the mom wrote. “I have looked into the expenses and I am needing to raise about $5,000 to ensure funeral costs are covered plus I’m wanting to leave something behind for my babies.” She added in her plea that while it was “hard for me to put my personal business out there today and to finally ask for help,” she had to do it for her children. Since creating the fundraiser after her original diagnosis, Diarte-Carr received a lot of support from those in her community. Since finding out she only has three months to live, the page has raised over $1 million. “All the funds that have exceeded my funeral cost will be now put into a trust fund for my babies,” the mom wrote in an update. “That way, I can leave behind something for them and I can still ensure they are going to be ok as they grow up.” “They are my whole life, light and soul. My children are my fight and what keep me going.” In an interview with ABC4 after the fundraiser blew up, she said, “It happened overnight. I never expected that.” “I never expected to have a big funeral service, or a lot of people reach out and help me. With the way it’s went, I’m just in shock … just very grateful for everybody and everything that’s been there.”",
      "genre": "health",
      "date": "30-09-2024",
      "keywords": [
        "cancer",
        "Fundraiser",
        "GoFundMe",
        "Utah",
        "funeral",
        "rare",
        "mom",
        "months",
        "support",
        "children",
        "fundraise"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/tech/2024/09/30/sos-mode-nationwide-verizon-cell-outage-impacts-millions-of-americans/",
      "title": "‘SOS Mode:’ Nationwide Verizon Cell Outage Impacts Millions of Americans",
      "author": "Alana Mastrangelo",
      "content": "Verizon suffered a nationwide outage on Monday morning, leaving millions of customers across the U.S. in SOS mode, unable to send and receive calls or text messages all morning and afternoon — with no end in sight for those still impacted. The outage appeared to kick in at around 9:30 a.m. EST with Verizon customers flooding DownDetector — a site that monitors tech issues — to report their cell service being stuck in SOS mode, while others noted they had bars, but were unable to send and receive calls or texts. By 10:15 a.m. EST, more than 100,000 customers reported Verizon outages with DownDetector, which suggests that the outage has impacted many more across the country. While Verizon has 114.2 million U.S. users, the amount of people impacted by the outage remains unclear. The issue also appears to be nationwide, with customers reporting problems everywhere from New York to California. “In Miami. Still SOS since 11 AM EST,” one customer reported. “No voice/text/data since this morning in Mid-Michigan,” another revealed. “I’m in Dallas,” another disclosed. “Started with just no incoming calls around 8:45am CT. then progressed to no outgoing calls an hour or so later. Now I’m unable to receive texts.” Similar reports from customers across the country flooded into DownDetector. As the day went on, Verizon customers became increasingly furious with the phone provider, expressing their dismay on DownDetector all afternoon. “This is fricken ridiculous!! I have a VERY important call coming and I can’t miss it!! Verizon get your stuff together! Ugh!! 5+ hours going now,” one customer exclaimed. “Have been down since 10:01 am in Warren, Ohio. My Husband is a Truck Driver, this is not acceptable,” another wrote. “I need my phone for work! Lost out on so much business today,” another lamented. At 3:30 p.m. EST, one customer wrote, “6 hours and counting… this is unreal,” while another commented, “Damn, didn’t expect it to be down this long.” “There’s no way this big of a company should be down for this long, I know y’all got people for this stuff,” another surmised. “Should we start looking for a new provider?” another customer asked. Verizon addressed the issue in a Monday morning X post, writing, “We are aware of an issue impacting service for some customers. Our engineers are engaged and we are working quickly to identify and solve the issue.” It remains unclear, however, when Verizon customers can expect their cell service to return to normal. Alana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.",
      "genre": "tech",
      "date": "30-09-2024",
      "keywords": [
        "Verizon",
        "SOS",
        "nationwide",
        "mode",
        "outage",
        "customers",
        "calls",
        "EST",
        "customer"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/2024-election/2024/09/30/hillbilly-energy-jd-vance-recounts-middletown-upbringing-viral-video-released-eve-debate/",
      "title": "‘Hillbilly Energy’ — JD Vance Recounts Middletown Upbringing in Viral Video Released on Eve of VP Debate",
      "author": "Nick Gilbertson",
      "content": "A viral video released Monday features Republican vice-presidential nominee Sen. JD Vance (R-OH) recounting his upbringing in Middletown, Ohio, and emphasizing he hails from the places he wants to represent. Republican strategist Andrew Surabian released the video on X, as Vance and Democrat vice-presidential nominee Gov. Tim Walz (D-MN) are set to square off in the lone vice-presidential debate Tuesday. “This is” JD Vance, Surabian wrote in his post, adding the hashtag “#HillbillyEnergy” — a play on Vance’s bestseller Hillbilly Elegy: A Memoir of a Family and Culture in Crisis. In the two-minute video featuring a previous interview from Vance, the 40-year-old populist notes that many feel as though the American Dream is becoming progressively out of reach before reflecting on his own upbringing in Middletown, Ohio, during the 1990s: The world I grew up in was one where I think for the first time really in American history, you know, my parents generation did not expect their children to necessarily have a better life than they did. And you saw that in all kinds of different ways, but there was this sense of growing up in Middletown in the 1990s that a lot of people didn’t expect the future to be better than the past, and that’s a really unique and a really tragic thing. While jobs left Middletown, once a dominant manufacturing city in the nation, drugs and “hopelessness” became prominent, Vance said. WATCH — Vance: Media, Harris Campaign Have Been “Calling the Residents of Springfield Racists”: “I wrote Hillbilly Elegy because I wanted to give people a sense of what it was like to live in a community like mine. I didn’t think a whole lot of stories were told about white working-class Americans,” he said. “I didn’t think a lot of stores were told about people who were struggling with some of the problems we were struggling with: joblessness, drug addiction, so forth,” he continued. “And I thought that I could tell a story that would make people understand my family a little bit better and maybe, in the process, understand the struggles of a lot of families.” Vance adds that the nation must begin electing officials who actually hail from the communities they want to represent in Washington, DC. “I come from the places that I want to represent, and what we need is to stop sending people who are of the D.C. swamp. We need to send people who are of the places they aim to represent,” he concluded.",
      "genre": "2024-election",
      "date": "30-09-2024",
      "keywords": [
        "debate",
        "Hillbilly Elegy",
        "JD Vance",
        "Ohio",
        "vice presidential debate",
        "Middletown",
        "upbringing",
        "viral",
        "video",
        "released",
        "Vance",
        "people",
        "lot",
        "represent"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/podcast/2024/09/30/breitbart-news-daily-podcast-ep-627-breitbart-world-editor-frances-martel-recaps-the-un-general-assembly/",
      "title": "Breitbart News Daily Podcast Ep. 627: Breitbart World Editor Frances Martel Recaps the UN General Assembly",
      "author": "Breitbart News",
      "content": "Breitbart World Editor Frances Martel joins host Mike Slater to recap last week’s gathering of world leaders at the United Nations General Assembly. How did El Salvador solve its gang problem while the U.S. is struggling to contain immigrant gangs? What do world leaders really think about Donald Trump? Frances has the answers. The Breitbart News Daily Podcast runs Monday through Friday as a “Director’s Cut” of the SXM Patriot radio show hosted by Mike Slater. SUBSCRIBE for free by clicking your preferred podcast platform below.",
      "genre": "podcast",
      "date": "30-09-2024",
      "keywords": [
        "Breitbart News Daily",
        "Breitbart News Daily Podcast",
        "UN General Assembly",
        "Breitbart",
        "Assembly",
        "Martel",
        "Editor"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/reports-israel-poised-for-limited-ground-war-in-lebanon/",
      "title": "Reports: Israel Poised for ‘Limited’ Ground War in Lebanon",
      "author": "Joel B. Pollak",
      "content": "The Israel Defense Forces (IDF) will begin a “limited” ground war in southern Lebanon to remove Hezbollah bases near the border with Israel, according to multiple reports. As Breitbart News reported Saturday, the IDF has already reportedly sent commando units into Lebanon on small missions to destroy Hezbollah positions. And as Breitbart News reported in April, the IDF had already been carrying out similar missions for several months. Now, however, with the senior leadership of Hezbollah dead, and the terror group’s communications destroyed, the IDF is reportedly planning a larger operation, and Israel’s security cabinet met Monday to consider options. The Times of Israel reported Monday that the U.S. State Department confirmed that Israel had informed it of its battle plans: Israel has informed the US about a series of limited ground operations into Lebanon that it is planning, US State Department spokesperson Matthew Miller says. “We have been engaged in conversations with them about those operations, but the timing, purpose, tempo of those — I’ll let them speak to,” Miller says, during a press briefing. “They have informed us about a number of operations. They have at this time, told us that those are limited operations focused on Hezbollah infrastructure near the border, but we’re in continuous conversations about it,” he adds. Separately, the IDF announced that “the areas of Metula, Misgav Am, and Kfar Giladi” — a region known as the “panhandle,” which is bounded by Lebanon on both the north and the west — were now “closed military zones.” Israel’s stated goal is to return its northern residents safely to their homes, after being evacuated in October due to Hezbollah fire. Israel hopes to achieve that by enforcing United Nations Security Council Resolution 1701 (2006), which calls for Hezbollah to withdraw north of the Litani River, and for it to be disarmed south of the Litani. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "Hezbollah",
        "Israel",
        "Israel Defense Forces (IDF)",
        "Lebanon",
        "reports",
        "limited",
        "ground",
        "IDF",
        "News"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/hezbollah-struggles-to-replace-leaders-after-devastating-israeli-strikes/",
      "title": "Hezbollah Struggles to Replace Leaders After Devastating Israeli Strikes",
      "author": "John Hayward",
      "content": "The ruling council of Lebanon’s Hezbollah terrorist organization announced on Sunday that Hashem Safieddine, cousin of slain leader Hassan Nasrallah, has been chosen to replace him as secretary-general. Nasrallah, 64, was killed on Saturday by a precision airstrike targeting his bunker in the southern suburbs of Beirut. He was a founding member of Hezbollah in 1982, taking command of the organization after his predecessor Sayyed Abbas Musawi was killed by an Israeli helicopter raid in 1992. Nasrallah has been credited with building up Hezbollah’s terrorism capabilities and using them aggressively throughout his reign, which was certainly not a happy achievement for the people of either Lebanon or Israel, but from Hezbollah’s perspective it makes him difficult to replace. The elimination of the seemingly untouchable Nasrallah probably also reduced the number of eager applicants for his job. Israeli Prime Minister Benjamin Netanyahu alluded to Nasrallah’s irreplaceable skill set when he said on Saturday: “As long as Nasrallah lives, he would quickly restore the capabilities we took away from Hezbollah.” Safieddine has a few important bullet points on his resume, beginning with the fact that he was one of the few high-ranking Hezbollah leaders who has not been liquidated by Israel over the past week. His familial connection and strong physical resemblance to Nasrallah are assets, and so is his tight connection to Hezbollah’s paymasters in Iran, by virtue of his son being married to the daughter of Tehran’s late terror master, Qassem Soleimani. Also, Safieddine’s brother Abdullah is Hezbollah’s “ambassador” to Iran. Safieddine has comparable Islamist credentials to Nasrallah, having studied alongside him at the Muslim religious schools in the Shiite holy cities of Qom and Najaf in Iran and Iraq, respectively. He currently leads Hezbollah’s executive council and also its “Jihad Council,” which Nasrallah established in the 1990s to coordinate attacks on Israel. He was designated a terrorist by the U.S. government in May 2017. Safieddine’s chief potential rival for secretary-general is Naim Qassem, Nasrallah’s deputy, who automatically assumed leadership duties on an interim basis until the ruling Shura Council of Hezbollah can designate a new secretary-general. Qassem, 71, also has solid credentials in both religious scholarship and political activism. He was one of the original Hezbollah religious scholars when the group was founded, having jumped ship from an older Shiite activist group in Lebanon called the Amal Movement. The Amal Movement is still around, still militant, and theoretically comparable to Hezbollah in political power, but it doesn’t have Iranian money and muscle behind it. Qassem has been Hezbollah’s deputy secretary-general for even longer than Nasrallah held the top spot. Hezbollah sources willing to speak to foreign media all seem to think Safieddine is more likely to take the top spot, because he has better Islamic religious credentials and Nasrallah was grooming him for leadership. Safieddine would provide a better sense of continuity than Qassem, which is important if Hezbollah wants to project the idea that killing Nasrallah inflicted no grievous permanent damage on the organization. “In our resistance … when any leader is martyred, another takes up the flag and goes on with new, certain, strong determination,” Safieddine himself boasted in July. Hezbollah is reportedly putting off the confirmation of a new secretary-general until after Nasrallah can receive a proper funeral, which might be tricky given Israel’s demonstrated ability to pick off Hezbollah big shots. “If you are inheriting something that has just been gutted, you are going to have to do things differently to put things back on track. Hezbollah will reconstitute, but the longer Israel keeps the pressure on, the harder it will be to do that,” national security professor Afshon Ostovar of the Naval Postgraduate School in California told the Washington Post on Saturday.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "Hassan Nasrallah",
        "Hezbollah",
        "Iran",
        "Islam",
        "Israel",
        "Lebanon",
        "terrorism",
        "replace",
        "terrorist",
        "chosen",
        "Nasrallah",
        "Safieddine",
        "Hezbollahs",
        "secretary"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/weather/2024/09/30/donald-trump-rips-kamala-harriss-fake-and-staged-photo/",
      "title": "Donald Trump Rips Kamala Harris’s ‘FAKE and STAGED Photo’",
      "author": "Hannah Knudsen",
      "content": "Former President Donald Trump on Monday ripped Vice President Kamala Harris’s “FAKE and STAGED” photo, featuring her supposedly speaking to FEMA on the ongoing Hurricane Helene recovery efforts. “Another FAKE and STAGED photo from someone who has no clue what she is doing,” Trump said of the now viral photo, which supposedly shows Harris speaking to FEMA. One of the main issues — that countless social media users have pointed out — is that Harris’s earbuds are not even connected to her phone, as the wire seemingly drops to her lap. It is not connected to her phone, which is sitting on the table in front of her. “You have to plug the cord into the phone for it to work!” Trump pointed out, pointing to a litany of failures by the Biden-Harris administration. “Biden and Harris abandoned Americans in Afghanistan. They sacrificed Americans to an Open Border, and now, they have left Americans to drown in North Carolina, Georgia, Tennessee, Alabama, and elsewhere in the South,” Trump exclaimed. “Under this Administration, Americans always come last, because we have ‘leaders’ who have no idea how to lead!” he added. Indeed, Harris came under fire over the weekend after Harris jetted off to Los Angeles to party with celebrities and studio executives at her glitzy fundraiser at the JW Marriott. Trump called her out, questioning how Harris could focus on that when “big parts of our Country are devastated and under water — with many people dead?” Many have called Harris out for her response to the hurricane — or lack thereof at this point, as Breitbart News detailed. WATCH — Spicy Brandon! Joe Biden Gets Testy with Reporter over Question on Hurricane Helene Response:\nVideo Source: White House Meanwhile, Trump is headed to Valdosta, Georgia, on Monday, set to deliver relief items to victims of the storm. Trump also said that he has supplies for residents of North Carolina as well, and while he planned to visit the area too, he logistically cannot interrupt local responders, taking attention away from those in need. Republican presidential nominee former President Donald Trump tours downtown Valdosta, Georgia, a town that was impacted by Hurricane Helene, on September 30, 2024. (AP Photo/Evan Vucci) “I’ll be there shortly, but don’t like the reports that I’m getting about the Federal Government, and the Democrat Governor of the State, going out of their way to not help people in Republican areas,” Trump added. Authorities have confirmed at least 116 to be dead in the aftermath of the major storm.",
      "genre": "weather",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "FEMA",
        "Hurricane Helene",
        "Kamala Harris",
        "STAGED",
        "photo",
        "FAKE",
        "Harris",
        "Kamala",
        "Trump",
        "Americans",
        "President"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/latin-america/2024/09/30/brazil-demands-twitter-pay-1-8-million-fines-elon-musk-free-speech-cave/",
      "title": "Brazil Demands Twitter Pay $1.8 Million in ‘Fines’ After Elon Musk Free Speech Cave",
      "author": "Christian K. Caruzo",
      "content": "The social media platform X (formerly Twitter) must pay a fine of ten million Brazilian reais (roughly $1.84 million) to restore its services in Brazil, Supreme Federal Tribunal (STF) Minister Alexandre de Moraes announced over the weekend. The demand comes roughly one month after de Moraes, an “anti-fake news” crusader, banned access to the X platform in Brazil after it initially refused to comply with censorship orders against a group of users as well as appoint a new legal representative in the country. After initially loudly condemning the Brazilian government’s demands, X announced that it would comply with Brazilian court-mandated censorship and reinstated Rachel de Oliveira Villa as its legal representative in Brazil. Twitter reportedly submitted a formal request to de Moraes to allow for its reinstatement in Brazil following compliance with the censorship orders and other court-mandated requirements. De Moraes, in a ruling issued on Friday, confirmed that X has complied with all the censorship orders issued by the court and appointed a legal representative in the country as requested by the Brazilian top court. He, nonetheless, conditioned the reinstatement of the platform in the country to the payment of the new $1.8 million fine. The fine, according to the ruling, was imposed in response to the platform’s “failure to comply, for two days” with the ban in mid-September. On that date, users were reportedly able to access the X platform from within Brazilian territory. X described the incident as “inadvertent and temporary” and attributed it to a switch in network providers in Latin America. In addition to the $1.8 fine, the court fined the social media platform’s legal representative Rachel de Oliveira Villa 300,000 Brazilian reais (roughly $55,284). The amount, according to the ruling, stems from the accumulated sum of a daily fine of 20,000 reais (roughly $3,656) imposed on the legal representative in mid-August at a time when the X platform was in defiance of the court’s orders. “According to the ruling, made in Petition (PET) 12404, X proved that it had fully complied with two requirements for the resumption of activities: the blocking of profiles and the appointment of a legal representative of the company in the country,” the STF announced. “However, it has yet to prove payment of the fines for non-compliance with the decisions.” The ruling stated that the STF ordered the Central Bank of Brazil to block the accounts of the X social media platform and its legal representatives, asserting that “no amounts were found sufficient to guarantee” the payment of Oliveira Villa’s fine in her accounts. The court demanded X inform if it will use the amounts the court order blocked to pay the fine and withdraw appeals filed against both the initial ban and the fines. “The end of the suspension of the operation of the X platform in national territory and, consequently, the immediate return of its activities depend solely on full compliance with Brazilian legislation,  the ruling read, “and absolute observance of the decisions of the judiciary, in respect for national sovereignty.” X’s compliance with de Moraes’ censorship orders comes after a months-long feud between de Moraes and X owner Elon Musk directly, following Musk’s initial refusal to comply with the censorship orders. Musk accused the judge of rigging the 2022 Brazilian election, which far-left President Luiz Inácio Lula da Silva narrowly won against then-incumbent conservative President Jair Bolsonaro. During Brazil’s 2022 presidential campaign, de Moraes imposed censorship orders on Bolsonaro’s campaign, banning it from describing Lula as a “thief” or “criminal” in reference to his multiple convictions on corruption charges. De Moraes has spearheaded a widespread, years-long censorship campaign against conservative Brazilian citizens, politicians, journalists, and comedians supportive of Bolsonaro. He has ordered police raids and arrests of these individuals, as well as the removal of their social media accounts across several platforms such as X, Facebook, YouTube, or Instagram. Some have also had their bank accounts frozen. Last week, during his speech at the United Nations General Assembly, Lula appeared to defend the censorship of conservative figures in Brazil, referring to it as necessary for “the defense of democracy.” RELATED — Don Lemon: Elon Musk ‘Seemed Really Averse to Facts’ Christian K. Caruzo is a Venezuelan writer and documents life under socialism. You can follow him on Twitter here.",
      "genre": "latin-america",
      "date": "30-09-2024",
      "keywords": [
        "Alexandre de Moraes",
        "Brazil",
        "Elon Musk",
        "free speech",
        "Internet Censorship",
        "X",
        "pay",
        "Twitter",
        "Supreme",
        "ten",
        "platform",
        "censorship",
        "Brazilian",
        "Moraes",
        "court"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/entertainment/2024/09/30/fake-heiress-anna-delvey-sorokin-claims-shes-victim-of-predatory-behavior-exploited-by-dancing-with-the-stars/",
      "title": "‘Fake Heiress’ Anna ‘Delvey’ Sorokin Claims She’s Victim of ‘Predatory’ Behavior, Exploited by ‘Dancing With The Stars’",
      "author": "Alana Mastrangelo",
      "content": "Anna “Delvey” Sorokin — who was convicted of grand larceny, attempted grand larceny, and theft of services after defrauding banks, hotels, and people in her life by pretending to be a German heiress — claims she was exploited by ABC’s Dancing With The Stars and accused those behind the hit ABC show of “predatory” behavior following her elimination. “I feel that the show so obviously used me to drive up the ratings, that they never had any plans to give me any chance to grow and only cared about exploiting me for attention,” Sorokin, whose story is depicted in the 2022 Netflix series, Inventing Anna, told NBC News. “It was predatory of them to try [to] make me feel inadequate and stupid all while I did get progressively better yet they chose to disregard that,” the fake heiress added. Notably, Sorokin — who was released from prison in 2021 after being convicted in 2019 of grand larceny in the second degree, attempted grand larceny, and theft of services — was the first contestant to be voted out of Season 33’s Dancing With The Stars. Sorokin made her Dancing With The Stars debut on September 17, performing the cha-cha with her professional partner, Ezra Sosa. There wasn’t a public vote during week one of the show, but Sorokin went on to be the first contestant eliminated that following week, on September 24. After being voted out and asked by the show’s co-host Julianne Hough, “What are you going to take away from this competition?” Sorokin replied with just one word: “Nothing.” Watch Below: Sorokin’s one-word quip went on to become a viral online meme. Alana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.",
      "genre": "entertainment",
      "date": "30-09-2024",
      "keywords": [
        "dancing with the stars",
        "grand",
        "exploited",
        "Delvey",
        "Anna",
        "larceny",
        "Sorokin"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/abcs-hostin-trump-is-proposing-a-nazi-like-kristallnacht-in-the-united-states/",
      "title": "ABC’s Hostin: Trump Is Proposing a Nazi-Like ‘Kristallnacht’ in the United States",
      "author": "Pam Key",
      "content": "ABC legal analyst Sunny Hostin said Monday on “The View” that former President Donald Trump is proposing a massive police raid like the incident known as Kristallnacht when Nazis in Germany attacked and killed Jewish people. Hostin said, “One thing about his floating, he said if you had one really violent day, he floats a plan to end crime in which he says that the police should be allowed one really violent day in which they could be extraordinarily rough with anyone they suspect of a crime. Now, as the mother of a black 6-[foot], 2-[inch] son, we know he’s going to send those police officers into black and brown communities and migrant communities. We also know that he believes that police officers should have immunity, and so for me, that means we are at risk of what happened in Nazi Germany, and they call that the, I can’t pronounce that, but they call it the night of broken glass.” Co-host Whoopi Goldberg said, “Kristallnacht.” Hostin said, “Kristallnacht, in which there was a wave of anti-Semitic violence in Nazi, Germany to attack the Jews. If a person is watching these violent movies and he’s talking about Hannibal Lecter and he’s talking about the night of broken glass, he’s in a dark place and he has a very dark vision of America. I really, really hope that people are paying attention to what he is saying because he is saying the quiet parts out loud.” Follow Pam Key on X @pamkeyNEN",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "2024 Presidential Election",
        "Donald Trump",
        "Nazi Germany",
        "Sunny Hostin",
        "Whoopi Goldberg",
        "Hostin",
        "Trump",
        "proposing",
        "Kristallnacht",
        "ABC",
        "police",
        "violent",
        "Germany"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/entertainment/2024/09/30/nolte-disgraced-jussie-smollett-still-claims-to-be-victim-of-maga-country-trumpers/",
      "title": "Nolte: Disgraced Jussie Smollett Still Claims to Be Victim of ‘MAGA Country!’ Trumpers",
      "author": "John Nolte",
      "content": "The dumber-than-dumb People Magazine offered convicted hate-hoaxster Jussie Smollett an unchallenged environment to continue to spread his ugly and divisive hoax. On January 29, 2019 — more than five freaken years ago — Smollett claimed he was the victim of a hate crime perpetrated by two white men at 2 A.M. in a freezing cold Chicago. The disgraced Empire star told the police (and the world) that these men asked if he was “that faggot Empire ni**er,” before beating him, looping a noose around his neck, and pouring bleach on him. Oh, and then they shouted, “This is MAGA country!” Gee, how lucky were these guys to be so prepared for a hate crime at 2 A.M. in an icy cold Chicago? Of course, it was a hoax. Police say Smollett invented the whole thing for attention and to get a bump in his Empire salary. Instead, he was fired by Empire and ultimately convicted of five counts of felony disorderly conduct. This came with a $130,160 fine and a 150-day jail sentence. He served only six days before being released on appeal in March of 2024. If his conviction is not overturned, Smollett may have to finish those other 144 days, which this entitled, spoiled brat deserves. Smollett is 42 years old and instead of admitting he did something stupid, that he regrets it, and serve his time, he continues to this very day to stand by and be defined by a reprehensible lie. Here he is in the latest People: Despite the narrative he says so many have assumed, Smollett maintains his innocence to this day. “I was numb,” he says, recalling the incident to PEOPLE. “I didn’t know how to connect the dots. I really genuinely did not know. I couldn’t make sense of what was going on, and I couldn’t make sense of what people were actually thinking … what exactly do they think happened? I couldn’t put two and two together.” There’s absolutely no journalism here. Why not ask him why his two black friends claim Smollett paid them to beat him up on the street posing as two Trump supporters? Challenge him a little bit. Instead, he’s allowed to pose as a victim and spout this nonsense: “I have a more adult grown-up way of talking about it now, but at the same time, my views have not changed,” he says, adding that he now approaches things with a “gentler” touch. “My heart has not shifted at all. I’m the same man that I was and will always be this way. If tons of people are listening to you, you should say something worth them hearing.” Smollett appears to have found a second career producing and directing TV movies about gay men for BET. Good for him. No one wants to deny him a living. We all deserve a second chance. But this guy does not deserve forgiveness or to be allowed to move on until he admits what he did and asks for forgiveness. The egomaniac is not contrite at all. He’s still spreading his toxic lie, which makes him a disgrace. Living a lie is exhausting. Most of us learn that as kids. Fess up. Get it behind you. Move on. Life is so much simpler that way. John Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.",
      "genre": "entertainment",
      "date": "30-09-2024",
      "keywords": [
        "hate hoax",
        "John Nolte",
        "Jussie Smollett",
        "People Magazine",
        "nolte",
        "Victim",
        "Life",
        "Move",
        "Fess",
        "Smollett",
        "couldn",
        "Empire",
        "hate",
        "day"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/watch-live-donald-trump-speaks-in-valdosta-georgia/",
      "title": "Watch Live: Donald Trump Speaks in Valdosta, Georgia",
      "author": "Breitbart News",
      "content": "Former President Donald Trump speaks in Valdosta, Georgia, about the disaster relief efforts for the area following Hurricane Helene.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "Hurricane Helene",
        "Trump",
        "Valdosta",
        "speaks",
        "Georgia",
        "Donald"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/kamala-harris-panned-fake-photo-responding-hurricane-helene/",
      "title": "Kamala Harris Panned for ‘Fake’ Photo Responding to Hurricane Helene",
      "author": "Kristina Wong",
      "content": "Vice President Kamala Harris was panned by critics for posting a seemingly staged photo to her official vice president X account of her responding to Hurricane Helene, a storm which has devastated cities across the southeast and killed more than 100 people. In the photo, which is of her aboard Air Force Two, shows her writing and wearing Apple earbuds with a cord. The photo was posted Sunday evening, presumably on her return to Washington after a weekend of fundraising for her presidential campaign. Critics, however, panned the photo as fake, highlighting that nothing can be seen on the paper she is writing on, and that her earbuds’ cord is not plugged into her iPhone in front of her. Author Hans Mahncke posted, “Fake imagery is all they have.” Writer Jeff Carlson posted: Everything about you is fake. Phone unplugged. Blank paper. On a flight to your next fundraiser. All a metaphor for your candidacy. Just a hollow shell of staged photo ops. News outlet The Quartering posted: Blank paper, headphones not plugged into anything. Literally NOTHING you do is real Buzz Anderson, former Air Force pilot and author posted: Ear buds in but unplugged from her phone. Blank paper in front of her. Empty brain. The Harris campaign in a snapshot. Harris spent the weekend fundraising in San Francisco, Los Angeles, and Las Vegas, returning Sunday in the aftermath of the hurricane, which has reportedly killed more than 100 across the southeast. Meanwhile, Trump announced on Monday that he would be heading to Georgia to survey the damage and bring aid. He said he also wanted to stop in North Carolina but did not want to distract from relief efforts there. He posted on Truth Social: We are now heading to Valdosta, Georgia, in order to pay my respects and bring lots of relief material, including fuel, equipment, water, and other things, to the State. Many politicians and Law Enforcement will be there. We’ll be saying hello to Franklin Graham, Burt Jones, Tyler Harper, Mike Collins, Austin Scott, Russ Goodman, Sam Watson, and the Mayor of Valdosta Scott James. They are working very hard. I was also going to stop into North Carolina, which has really been hit hard. I have a lot of supplies ready for them, but access and communication is now restricted, and we want to make sure that Local Emergency Management is able to focus on helping the people most affected, and not being concerned with me. I’ll be there shortly, but don’t like the reports that I’m getting about the Federal Government, and the Democrat Governor of the State, going out of their way to not help people in Republican areas. MAGA!",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Air Force Two",
        "Donald Trump",
        "Hurricane Helene",
        "Kamala Harris",
        "Harris",
        "panned",
        "photo",
        "responding",
        "Helene",
        "posted",
        "paper",
        "Blank"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/2nd-amendment/2024/09/30/breitbarts-awr-hawkins-receives-2a-lifetime-achievement-award/",
      "title": "Breitbart’s AWR Hawkins Receives 2A Lifetime Achievement Award",
      "author": "Breitbart News",
      "content": "Breitbart News’s AWR Hawkins received the Second Amendment ‘Lifetime Achievement Award’ from the Citizens Committee for the Right to Keep and Bear Arms (CCRKBA) at the 39th Annual Gun Rights Policy Conference over the weekend. Hawkins has written over 16,600 articles during his 14+ years at Breitbart, working each day not simply to report on the Second Amendment but to educate and encourage Americans regarding gun rights as well. Breitbart Editor-in-Chief Alex Marlow commented on Hawkins’ award. “When it comes to second amendment journalism, AWR Hawkins is in a class by himself,” Marlow said. “He is quite literally a tireless defender of constitutional rights. I’m not exaggerating; he gets up in the middle of the night to get things done. You couldn’t stop him if you tried. We’re all proud of him at Breitbart News.” We asked Hawkins what the award means to him and he described it as a “tremendous honor,” adding, “It is a wild thought that getting up every day, making coffee, and sitting down to report and defend gun rights draws an accolade, particularly this accolade. I am humbled to receive the award and am thrilled to now be living in a time when the judicial tide has turned in favor of the Second Amendment.” He continued, “I look forward to continuing to write on guns and gun rights at Breitbart News and remain very proud to be part of the Breitbart team.” Hawkins was awarded CCRKBA’s ‘Journalist of the Year’ in 2015, 2017, and 2019; the ‘Gun Rights Defender of the Year‘ in 2020; and the ‘Bill of Rights‘ award in 2021.",
      "genre": "2nd-amendment",
      "date": "30-09-2024",
      "keywords": [
        "AWR Hawkins",
        "Second Amendment",
        "Lifetime",
        "Award",
        "Breitbart",
        "AWR",
        "Hawkins",
        "rights",
        "Amendment"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/ron-desantis-urges-federal-government-help-north-carolina-we-have-what-we-need/",
      "title": "Ron DeSantis Urges Federal Government to Help North Carolina: ‘We Have What We Need’",
      "author": "Hannah Knudsen",
      "content": "Florida Gov. Ron DeSantis said on Monday that the federal government should focus on helping the people in North Carolina in the aftermath of Hurricane Helene. Speaking on the storm efforts on Monday, DeSantis said he was flying when President Joe Biden called him, so he was not able to speak with him. “What I would say is … Florida — we have it handled, we got approved for the individual assistance, things we’ve wanted. We have what we need now — obviously, you know, there may be additional things that we’ll ask for in the future,” DeSantis said, explaining that it depends on “how things shake out.” “But I think most of the effort should be in western North Carolina right now, because you still have active rescues that need to take place,” DeSantis said, pointing relief efforts that way. “I mean, just think about it; it’s almost like if this area were totally cut off and every road was destroyed and all this, but you can still get places by boat — there you can’t do that … and I just think they should really — the federal government should focus on that,” the Florida governor said. “We’re running rescue flights. We’re happy to do it, but I know the federal government has more assets than the state of Florida has, so there should not be anybody left behind,” he added. WATCH: DeSantis’s remark comes as Harris receives backlash for largely ignoring the devastating impact of Hurricane Helene, which ravaged not only Florida and Georgia, but also western North Carolina. Over the weekend, Harris opted to party with celebrities and studio executives at her glitzy fundraiser at the JW Marriott in downtown Los Angeles on Sunday afternoon. As Breitbart News detailed: Among those in attendance at Sunday’s Harris-Walz Hollywood fundraiser were Demi Lovato, Stevie Wonder, Jessica Alba, Lily Tomlin, and Sterling K. Brown, according to multiple reports. Former Disney chief and Democrat fundraiser Jeffrey Katzenberg was there, as were Universal boss Donna Langley and Hollywood PR maven Kelly Bush Novak. The shindig reportedly raised more than $28 million for the Harris-Walz campaign. Kamala Harris spent the weekend rubbing elbows with celebrities as millions of Americans in the southeast continued to pull themselves out of the destruction caused by Hurricane Helene. President Joe Biden told reporters that the federal government won’t be giving people affected by the hurricane any more federal resources. She was also ripped for posting a staged photo: RELATED — Spicy Brandon! Joe Biden Gets Testy with Reporter over Question on Hurricane Helene Response\nVideo Source: White House Even former President Donald Trump, who headed to Valdosta, Georgia, on Monday to deliver relief items, called Harris out. “Why is Lyin’ Kamala Harris in San Francisco, a City that she has totally destroyed, at fundraising events, when big parts of our Country are devastated and under water – with many people dead?” Trump asked on Sunday. Trump also explained on Monday that he planned to visit North Carolina as well and has “a lot of supplies ready for them.” “But access and communication is now restricted, and we want to make sure that Local Emergency Management is able to focus on helping the people most affected, and not being concerned with me. I’ll be there shortly, but don’t like the reports that I’m getting about the Federal Government, and the Democrat Governor of the State, going out of their way to not help people in Republican areas,” Trump added. RELATED — Monster! Hurricane Helene Seen from Space\nVideo Source: International Space Station via Storyful",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "Hurricane Helene",
        "Kamala Harris",
        "North Carolina",
        "Ron DeSantis",
        "federal",
        "government",
        "Ron",
        "DeSantis",
        "North",
        "Harris",
        "Florida",
        "people",
        "Hurricane",
        "Helene"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/exclusive-donald-trump-kamala-harris-would-decimate-social-security-medicare-theyre-going-be-destroyed-if-she-wins/",
      "title": "Exclusive — Donald Trump: Kamala Harris Would ‘Decimate’ Social Security and Medicare; ‘They’re Going to Be Destroyed’ If She Wins",
      "author": "Matthew Boyle",
      "content": "Former President Donald Trump told Breitbart News exclusively that Vice President Kamala Harris would “decimate” Social Security and Medicare if she won the election, and the only way to protect those programs is to vote for him. Asked during a nearly hour-long interview last weekend about Democrats privately sounding the alarm about Harris’s silence on Social Security and Medicare as Politico reported earlier in September, Trump sounded off, saying she avoids talking about the programs because people know her policies would destroy them. “So she doesn’t talk at all about Social Security or Medicare because everyone knows she’s going to decimate them,” Trump told Breitbart News. “They’re going to be destroyed. There’s no way to fix it once she does that. There’s no way anybody could pay for it because she’s putting migrants in there at levels nobody has ever seen. She is destroying Social Security and Medicare. She won’t bring it up because she can’t justify it. She can’t answer the question.” Politico reported, in the wake of the Teamsters union refusing to endorse Harris as polling of its members shows large-scale support for Trump, that Democrats are worried about Harris’s lack of focus on the issues of Social Security and Medicare. An anonymous elected Democrat in Pennsylvania is quoted by Politico saying that this Democrat is “worried about her with” seniors. “Most of all, I just think they don’t know her,” the anonymously quoted Pennsylvania Democrat said. “She should be coming in on Medicare and Social Security like non-fucking-stop.” Trump told Breitbart News that Harris’s essentially policy-free campaign shows a lack of substance or seriousness on major issues, including most importantly immigration and the impact it has on programs like these and on public safety. Trump again noted how unserious Harris was, too, in her interview with Oprah Winfrey recently. “She can’t answer almost any question on almost any subject,” Trump said. “She’s destroying our country. The hardest question for her is: ‘Why have you allowed 21 million people into this country, many of them criminals and terrorists? Why have you done that?’ She could not answer the question. She couldn’t answer any question on Oprah.” Trump also explained that the vast majority of Teamsters members are supportive of him. Trump’s support among working-class voters is at record levels for a modern Republican, per CNN’s Harry Enten: In fact, as Breitbart News has reported, the Teamsters’ own polling shows Harris trailing Trump in all 50 states among its members—including significant leads for Trump in battleground states. “The members are actually in revolt because they’re saying, ‘Wait a minute, Trump won with approximately 60 percent of the vote. Why haven’t we endorsed him? Why haven’t we endorsed Trump?’ Her number was down in the 30s,” Trump said. “They don’t know who she is or where she is. I watched the Oprah show and every answer was an embarrassment. It was almost like she has a very small reel of answers and she just uses them no matter what question is asked. If she meets with President Xi or with Putin or all these people, this country is going to be destroyed. If she wins and has to meet with these people, they will never have been so lucky.” When Breitbart News pointed out to Trump a previous story this outlet published that recounted how Harris’s answers to three different questions about the Israeli war in Gaza in three different settings were nearly identical and robotic, Trump laughed and said: “She’s got no vocabulary. It’s unbelievable if you look at it.” Trump also said Harris’s appearance on Oprah was “the weirdest” thing he has seen recently, and reiterated he thinks Harris has “something wrong with her.” “I actually think there’s something wrong with her, and we can’t take a chance,” Trump said. “We’ve gone through four years of that and she and everybody else lied about his cognitive health. We cannot have four more years of that.” Trump of course would later, while at a campaign event this weekend in Wisconsin, note that while Biden became impaired mentally, “Kamala was born that way.”",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "Exclusive 2024 Elections",
        "immigration",
        "Kamala Harris",
        "Medicare",
        "On the Hill",
        "Oprah Winfrey",
        "Social Security",
        "Teamsters",
        "Security",
        "Social",
        "President",
        "decimate",
        "Trump",
        "question"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/nolte-kamala-harris-has-absolutely-no-idea-how-bill-becomes-law/",
      "title": "Nolte: Kamala Harris Has Absolutely No Idea How a Bill Becomes a Law",
      "author": "John Nolte",
      "content": "During a friendly interview with the All the Smoke podcast, sitting Vice President Kamala Harris proved she has no idea how a bill becomes a law. What we have here is another situation where Kamala is interviewed by her own fans and asked puffball questions in the hopes of making her look good and in command. Unfortunately for her, she’s an idiot with no grasp of why she believes what she believes, and your only takeaway from the interview is how dumb and shallow she is. One of the hosts offered her this layup: “Explain how a bill becomes a law.” What happened next was pure comedy, a skit involving a dumb person speaking like they believe smart people talk. This is really something: I believe that the best way the system works is when the power is with the people, to then advocate for their [sic] and have their needs met. So that’s the big macro stepping back, right? One of the ways the system works to do that—that the system should work to do that, is we have elected representation who represent the people in these state legislatures, which is where laws get passed. Or in Congress, which is where the federal laws get passed. And for the system to work the right way, legislators, these members of the state legislature, let’s say it’s a state senator, state assemblymember, or your congressman or your United States Senator, will meet with and they’ll have ways of receiving information from the people about what they want. I think it’s really important always that we know our power to organize around what we need, and sometimes that will take the form of writing letters, sometimes it will take the form of mass protests to make sure the voice of the people is heard by their representative leaders who then have as their responsibility to write up some legislation that meets the needs of the people. And then when they write that up, they take a vote in their body, if it’s a statehouse or Congress, and if the majority of the people there agree with it, it becomes a law. So that’s how it’s supposed to work, and I mean it does connect to what we were talking about earlier which is then reminding folks they have a right and a right to expect that their leaders will hear them and take seriously their needs. No. That’s not how it works. And if you watch the video, you can see her spouting all this nonsense to stall for time in the hope the real answer comes to her. She forgot all about the executive branch. Nothing becomes a law until a governor or U.S. president signs it. Yes, both legislative bodies have to pass it with a majority, but it then goes to the executive branch in the form of a governor or president for final approval. It is the executive branch’s approval that finally turns a bill into a law. This woman was a U.S. Senator. How can she not know this? This woman is a sitting vice president. How can she not know this? This woman is running for president. How can she not know this? Does she even know the office she is running for? Kamala and I are only a year apart, which means we both had access to the same Saturday morning cartoons… Duh: What was she doing on Saturday mornings? We know she wasn’t reading or working at McDonald’s. What a dummy this woman is — much dumber than I thought. John Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "2024 presidential race",
        "Congress",
        "John Nolte",
        "Kamala Harris",
        "idea",
        "bill",
        "law",
        "Nolte",
        "Kamala",
        "people",
        "system",
        "woman",
        "president"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/latin-america/2024/09/30/communist-nicaragua-demands-climate-justice-from-greedy-slavers-at-u-n/",
      "title": "Communist Nicaragua Demands ‘Climate Justice’ from ‘Greedy Slavers’ at U.N.",
      "author": "Christian K. Caruzo",
      "content": "Nicaraguan Foreign Minister Valdrack Ludwing Jaentschke declared that Nicaragua is “one” with other rogue regimes around the world such as Cuba, Venezuela, Russia, and China in his ideological speech at the United Nations General Assembly on Monday morning. Jaentschke, recently appointed by communist dictator Daniel Ortega as his communist regime’s top diplomat this month, described his country as “blessed, dignified, always sovereign, Christian, socialist, and solidarity inspired.” The minister sent an “embrace to everyone in the world who wants peace,” presenting a differing image from that of the authoritarian communist regime he represents, which boasts a deplorable track record of human rights violations against dissidents and brutal persecution of Christianity: In addition to pledging Nicaragua’s support for other like-minded rogue regimes, Jaentschke spent much of his address denouncing war as a “savage method of imperialism” and labeling capitalism “savage, barbaric and fierce,” leading to the extinction of all living beings. Jaentschke claimed the values of “love, fraternity, and hope” are victims of a “Hell” marketed as “paradise” by “Satanic majesties.” The Ortega regime representative also condemned Israel “and its First World allies” for its alleged “genocide” in Gaza and Lebanon – and against “so many other valiant, brave, and dignified peoples that do not subordinate themselves to brutality.” “We are not silent, and we will not be silent. We denounce and condemn the aggression against Syria, Iran, and so many other great and combative brothers and sisters on all continents,” Jaentschke said. The minister also denounced a purported “systematic policy of extermination of cultures and rights” allegedly committed by “colonialists and imperialists powers” against the rogue Latin American regimes of Cuba, Venezuela, Bolivia, and Nicaragua that form part of the ALBA “anti-imperialist” far-left regional bloc. “Nothing is free in this world. We must grow in consciousness and heart every day, absolutely lucid, absolutely clear, absolutely convinced and consistent, because only the unity of the peoples of the planet will stop the imperialists of the Earth,” Jaentschke said. The minister then declared that, as part of ALBA, his country is “one” with Venezuela’s late socialist dictator Hugo Chávez and his successor Nicolás Maduro, as well as Cuba and its communist Castro regime, Bolivia and its “much-respected ways,” and Russia in its “great battles against bestial fascism.” Jaentschke also made special note of China, which expanded its control of Nicaraguan natural resources such as gold at an accelerated pace through hastily prepared loans and agreements signed under the auspices of dictator Ortega. “We are one with the People’s Republic of China that teaches us so much, transferring to us its magnificent, great Experience of building the well-being of its people, and of solidarity with the whole world, for a community of the future,” he said. The Nicaraguan foreign minister also expressed his “solidarity” with countries that are victims of alleged climate change and demanded “climate justice” from the “greedy slavers, filibusters and looters of this world.” “With everyone so, always united, we go forward to the always further on of our victorious General Augusto Sandino, and of the immortal poetry of our great Rubén Darío, and his songs of hope,” Jaentschke said before concluding his speech with by reciting a poem by Darío. Christian K. Caruzo is a Venezuelan writer and documents life under socialism. You can follow him on Twitter here.",
      "genre": "latin-america",
      "date": "30-09-2024",
      "keywords": [
        "China",
        "Communism",
        "Daniel Ortega",
        "Iran",
        "Israel",
        "Nicaragua",
        "U.N. General Assembly",
        "United Nations",
        "declared",
        "rogue",
        "regimes",
        "Jaentschke",
        "communist",
        "minister",
        "regime",
        "Nicaraguan"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/sports/2024/09/30/video-man-stomps-another-fans-head-during-insane-brawl-falcons-saints-game/",
      "title": "VIDEO: Man Stomps on Another Fan’s Head During Insane Brawl at Falcons-Saints Game",
      "author": "Warner Todd Huston",
      "content": "A horrific brawl broke out at Mercedes-Benz Stadium during the Atlanta Falcons’ 26-24 win over the New Orleans Saints on Sunday. The video shows fans pushing, punching, and even stomping each other’s heads on the upper levels of the stadium in Atlanta. The fight appears to have occurred around section 321 in the upper reaches of the stands. One man is seen stomping on the head of a man who fell to the deck before a woman drags him away from the fight. The man whose head was stomped does not appear conscious after being stomped. WATCH: Another video from a different angle shows more of the melee. A post shared by Mann Stalls (@og_manndagreat) Unfortunately, that was not the only upper-deck brawl on Sunday. A video shows two other young fans fighting as well. Fights between NFL fans seem to be a weekly occurrence during football season. A few weeks ago, a woman was slammed to the ground during the Raiders-Chargers game. Follow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, or Truth Social @WarnerToddHuston",
      "genre": "sports",
      "date": "30-09-2024",
      "keywords": [
        "Atlanta Falcons",
        "Fan Fights",
        "New Orleans Saints",
        "NFL",
        "Falcons",
        "brawl",
        "Saints",
        "video",
        "Orleans",
        "MLFootball",
        "upper",
        "fans",
        "deck",
        "FIGHT"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/pollak-five-questions-to-expect-from-the-vp-debate/",
      "title": "Pollak: Seven Questions to Expect from the VP Debate",
      "author": "Joel B. Pollak",
      "content": "Sen. JD Vance (R-OH) and Minnesota Gov. Tim Walz (D), the running mates for former President Donald Trump and Vice President Kamala Harris, respectively, will debate on Tuesday night on CBS News at 9:00 p.m. Eastern time. Here are five questions to expect — either because the moderators will ask them, or because the candidates will raise them (the debate rules prohibit asking each other questions, as with the presidential debate, but it happened anyway). 1. Vance will have to explain his “childless cat ladies” remark. Vance made the comment in 2021, before he became a U.S. Senator, during an interview with Tucker Carlson. His point was that liberal elites are making policies for other Americans without anything at stake. But he will have to explain the remark, which Democrats have used to portray him as insensitive to women, and to families that do not follow a traditional model, for whatever reason. 2. Walz will have to explain his long history of ties to China. The ABC News moderators did not bother to ask about China during the presidential debate. so Vance might have to bring up the topic on his own. Walz has a particular case to answer: he traveled to China extensively over the years, and has been accused of unusual warmth toward the communist regime. It is unclear why he is obsessed with China, and what that means for the country. 3. Vance will have to explain the “dogs and cats” controversy. The town of Springfield, Ohio, has been in the news because of the migration of vast numbers of Haitians — and because of accusations, later found to be without foundation, that the migrants have been eating people’s pets. The moderators are certain to repeat questions Vance has faced from interviewers over the past few weeks about whether he and Trump are drumming up racial prejudice. 4. Walz will have to explain his exaggerations about his military service. Vance has repeatedly pointed out that Walz embellished his record as a National Guard reservist: he falsely claimed to have carried a gun in combat; he falsely claimed to have served in Afghanistan; and he falsely claimed to have retired as a command sergeant major. Walz has responded poorly to this question on the rare occasions when he has been asked about it by journalists. 5. Vance will have to explain his past opposition to Trump. Democrats love to note that Vance said some of the same things about Trump once upon a time that they say today. His answer has been that he changed his mind based on Trump’s performance in office, and of course Trump knew Vance’s history when he named him his running mate. Still, Walz will enjoy telling America that “even” Trump’s running mate didn’t like him. Vance needs answer. 6. Walz will have to explain his poor performance as governor. The media have praised Walz, but have ignored his record, because it’s bad. Under Walz, Minnesota is basically a cold version of California. Its economy lags behind the rest of the country; residents are leaving, but foreign migrants are flooding in; violent crime has risen; education has fallen; and Walz is trying to end fossil fuels. It’s also a “sanctuary” for transgender surgery for minors. 7. Both candidates will have to explain what makes them ready to serve as president, if needed. Walz is a hitherto obscure governor; Vance is in his first term in the Senate. Both have served in the military; Walz was also a teacher, and Vance also had a career in venture capital. But both have been primarily focused on attacking the other side in the election, rather than on their cown redentials. Both must show they are ready to be commander-in-chief. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak. This article has been updated from “five” to “seven” questions.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "debate",
        "JD Vance",
        "Tim Walz",
        "President",
        "pollak",
        "mates",
        "Eastern",
        "Vance",
        "Walz",
        "Trump",
        "explain",
        "China"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/sports/2024/09/30/nba-player-aj-griffin-explains-sudden-retirement-gave-up-basketball-to-follow-jesus/",
      "title": "NBA player AJ Griffin Explains Sudden Retirement: ‘Gave up Basketball to Follow Jesus’",
      "author": "Warner Todd Huston",
      "content": "Atlanta Hawks player AJ Griffin announced he was quitting the NBA this year, only two years after being drafted. Now, the 21-year-old explains why he suddenly quit the pros: He’s quitting to follow Jesus. Griffin played in 92 games and averaged 7.5 points and 17.1 minutes per game during his short NBA career with the Hawks. But just as he prepared to play for the Houston Rockets this season, he announced his retirement. Fox News reported that Griffin has told fans in a YouTube video that he is putting his faith in Jesus ahead of basketball. “I gave up basketball to follow Jesus,” the now-former player said. “And I know that in a lot of people’s eyes, that seems like, it seems like a loss in the world’s eyes. But I just want to let you guys know that I’m super excited because I truly get to serve God, you know, with my full Yes, and I feel like letting go of basketball is allowing me to, you know, go into full-time ministry and truly serving the Lord with all my heart — with all my time too, as well. So, I’m just excited to see where that leads me.” Griffin says that he gave his “full life to Christ” in 2020 and now feels compelled to devote his entire attention to his religion. He feels he was being called to let go of basketball to serve the Lord. He also cites Matthew 10:39, which says, “He who finds his life will lose it, and he who loses his life for my sake will find it.” Griffin’s buyout opens a roster spot for the Rockets, though the team already has an impressive line-up. They could even leave the spot empty just for a little flexibility for trading later in the season. Follow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, or Truth Social @WarnerToddHuston",
      "genre": "sports",
      "date": "30-09-2024",
      "keywords": [
        "Atlanta Hawks",
        "B Inspired News",
        "Christianity",
        "faith",
        "Houston Rockets",
        "NBA",
        "player",
        "Jesus",
        "explains",
        "quitting",
        "follow",
        "Griffin",
        "basketball",
        "life",
        "AJ Griffin"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/nolte-trump-increases-lead-harris-north-carolina/",
      "title": "Nolte: Trump Increases Lead over Harris in North Carolina",
      "author": "John Nolte",
      "content": "With a presidential race this close, the smallest movement in the polling feels seismic. In this particular North Carolina poll, former President Trump led by a single point last month. Today, he leads by two points. It’s enough to drive you to drink. East Carolina U polled 1,005 likely North Carolina voters between September 23-26 and found Trump leading sitting Vice President Kamala Harris by two points, 49 to 47 percent. At the end of August, Trump led by a single point, 48 to 47 percent. WATCH — CNN’s Tapper: Harris Took a Different Border Stance When She Thought It Was Politically Beneficial to Do So: In the RealClearPolitics average poll of North Carolina state polls, Trump leads by a meager 0.6 points. However, in 2016, on this same day, Trump led Hillary Clinton by an average of 0.3 points. He would go on to win the state by a fairly comfortable margin of 3.6 points. Also, on this same day in 2020, Joe Biden led in North Carolina by an average of 0.5 points. Trump would go on to win the state by 1.3 points. Looking at the overall polling during the weekend and today, Trump has a little wind at his back. Of the 11 most recent polls out of Pennsylvania, the state could very well decide the election.  Harris has only led in one. Trump has led in four. Six are tied — which is pretty incredible. WATCH — Crowds Gather Outside Pennsylvania Grocery Store to See Trump: There’s no doubt Harris had a terrible weekend, which is not yet reflected in the polls. Her inane decision to visit the southern border after four years of ignoring it, an act that only drew attention to her biggest political weakness, will be remembered as a fatal error should she lose the election. Additionally, on top of Kamala’s Dukakis-style border visit, America was hit with the news that up to 650,000 of the ten-plus million migrants the Biden-Harris administration has allowed into the country are criminals and criminal suspects. More than 13,000 are murderers on the loose. Trump wasn’t lying when he said foreign countries are opening up their prisons and sending the bad guys into Kamala’s America, where they are welcomed with free rent, free healthcare, and a monthly allowance. Real Americans should have it so good. It will also be interesting to see how the Biden-Harris administration’s lack of action regarding the flooding here in Western North Carolina plays out with voters. New York or Washington, DC, get two inches of snow and it leads the national news for days. Our little towns have been ravaged or wiped out entirely. Where the hell is everyone? John Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "John Nolte",
        "Kamala Harris",
        "North Carolina",
        "polling",
        "Trump",
        "Carolina",
        "North",
        "nolte",
        "Harris",
        "led",
        "poll"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/tech/2024/09/30/electric-time-bomb-tesla-bursts-into-flames-inside-garage-flooded-by-hurricane-helene/",
      "title": "Electric Time Bomb: Tesla Bursts into Flames Inside Garage Flooded by Hurricane Helene",
      "author": "Lucas Nolan",
      "content": "A Tesla electric vehicle caught fire while parked inside a garage that was flooded with saltwater from Hurricane Helene in Florida, prompting officials to issue warnings to EV owners in storm-affected areas. WFLA reports that dramatic surveillance footage released by Pinellas County authorities in Florida shows the moment a parked Tesla spontaneously burst into flames inside a garage that had been inundated by floodwaters from Hurricane Helene. The video reveals how the fire originated underneath the electric vehicle and rapidly spread, completely engulfing the car in flames within a span of just one minute as thick, billowing smoke filled the cluttered garage space. The alarming incident occurred after Hurricane Helene battered Florida and other southeastern states like North Carolina, causing extensive flooding in many areas. In response to the Tesla fire, Pinellas County officials took to Facebook to share the video footage and caution owners of electric vehicles about the potential risks associated with water damage from the hurricane. “Electric Vehicles that have been flooded in saltwater can catch fire,” the Pinellas County Government warned in their Facebook post on Saturday. “If you evacuated and left an electric vehicle or golf cart in your garage or under a building and you are not able to get to it or move it, we want you to let us know.” Authorities further advised EV owners to take necessary precautions to prevent similar fire hazards. They strongly recommended against charging, driving, or storing electric vehicles and e-bikes inside homes or garages if the vehicles had been exposed to saltwater flooding. The county stressed that any flooded electric vehicle should be moved at least 50 feet away from flammable materials and towed to a dealership for a thorough safety inspection before attempting to operate it again. Breitbart News has previously reported on the dangers of EV batteries impacted by salt water. In 2022, Florida Chief Financial Officer and State Fire Marshal Jimmy Patronis wrote an urgent letter to the NHTSA seeking guidance on how to deal with the threat of EV fires caused by stormwater: “The State Fire Marshal’s Office is in need of immediate guidance regarding the response to fires produced by electric vehicles (EVs) that are compromised as a result of lithium batteries corroding from exposure to salt water,” Patronis said in his letter. Last week, electric vehicles were seen catching on fire in Florida after becoming waterlogged during Hurricane Ian, giving firefighters “a new challenge” they “haven’t faced before,” Patronis said. “I joined North Collier Fire Rescue to assess response activities related to Hurricane Ian and saw with my own eyes an EV continuously ignite, and continually reignite, as fireteams doused the vehicle with tens-of-thousands of gallons of water,” Patronis continued in his letter to the NHTSA. Read more at WFLA here. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship.",
      "genre": "tech",
      "date": "30-09-2024",
      "keywords": [
        "Electric Vehicle (EV)",
        "Florida",
        "Hurricane Helene",
        "Tesla",
        "electric",
        "garage",
        "Hurricane",
        "flooded",
        "vehicle",
        "fire",
        "vehicles"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/gavin-newsom-signs-bill-barring-local-authorities-from-requiring-voter-id/",
      "title": "Gavin Newsom Signs Bill Barring Local Authorities from Requiring Voter ID",
      "author": "Joel B. Pollak",
      "content": "California Gov. Gavin Newsom signed a bill Sunday that will bar local authorities from requiring photo ID to vote, which exceeds the state’s requirements. California is one of 14 Democrat-run states that do not require any ID to vote, despite requiring it for many other purposes. Voters at polling places are checked off against voter rolls without further proof being required; voters who submit mail-in ballots must include their signatures on the envelopes that are checked by a machine against the signatures on file in voter registration records. The City of Huntington Beach, one of the last conservative bastions in the state, which often opposes Democratic policies, planned to require photo ID for voting in 2024, after a ballot initiative passed to that effect in March. The new law, SB 1174, “would prohibit a local government from enacting or enforcing any charter provision, ordinance, or regulation requiring a person to present identification for the purpose of voting or submitting a ballot at any polling place, vote center, or other location where ballots are cast or submitted, as specified.” The text of the law also claims, without evidence: “Voter identification laws have historically been used to disenfranchise low-income voters, voters of color, voters with disabilities, and senior voters.”\nPolitico reported on the new law, and another that bans local authorities from prohibiting vote-counting machines: The legislation — from state Sen. Dave Min, an Orange County Democrat running for Rep. Katie Porter’s open House seat — is a direct response to a controversial ballot measure approved this year by voters in Huntington Beach requiring people to show photo identification at the polls. It will take effect on Jan. 1. … Legislation from state Sen. Steve Bradford, signed into law Wednesday, clarifies record-keeping procedures for secure elections data and increases the secretary of state’s regulatory power over poll books and other voting systems used in local elections. Ultraconservative local officials in Shasta County unsuccessfully attempted to dump electionic voting machines last year, citing baseless concerns of voter fraud. Their arguments mimicked claims about voting machines made by former President Donald Trump following the 2020 presidential election. California is certain to support Vice President Kamala Harris in the presidential election, but there are several close congressional races in the state that could have a significant impact on the balance of power in Washington. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "California",
        "Gavin Newsom",
        "Voter ID",
        "bill",
        "local",
        "authorities",
        "requiring",
        "Gavin",
        "voters",
        "voting",
        "law",
        "vote",
        "Newsom"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/donald-trump-bringing-lots-relief-material-hurricane-victims/",
      "title": "Donald Trump Bringing ‘Lots of Relief Material’ to Hurricane Victims",
      "author": "Hannah Knudsen",
      "content": "Former President Donald Trump is on his way to Valdosta, Georgia, to bring “lots of relief material” to victims of Hurricane Helene, explaining that he plans to go to North Carolina as well, but he first wants to make sure that local emergency management is focusing on helping the people most affected and “not concerned with me.” “We are now heading to Valdosta, Georgia, in order to pay my respects and bring lots of relief material, including fuel, equipment, water, and other things, to the State,” Trump said in a Truth Social post Monday, previewing some of the other notable individuals who will be there. WATCH — Spicy Brandon! Joe Biden Gets Testy with Reporter over Question on Hurricane Helene Response: “Many politicians and Law Enforcement will be there. We’ll be saying hello to Franklin Graham, Burt Jones, Tyler Harper, Mike Collins, Austin Scott, Russ Goodman, Sam Watson, and the Mayor of Valdosta Scott James. They are working very hard,” Trump continued, explaining that he plans to visit North Carolina very soon, but has not been able to yet logistically, as he does not want to take attention away from local officials who are helping the people affected by the storm. “I was also going to stop into North Carolina, which has really been hit hard. I have a lot of supplies ready for them, but access and communication is now restricted, and we want to make sure that Local Emergency Management is able to focus on helping the people most affected, and not being concerned with me,” Trump explained. “I’ll be there shortly, but don’t like the reports that I’m getting about the Federal Government, and the Democrat Governor of the State, going out of their way to not help people in Republican areas. MAGA!” Indeed, the Trump campaign announced the former president will visit Valdosta on Monday in the aftermath of the hurricane — a great contrast to Vice President Kamala Harris, who has been mocked for posting a staged photo talking to FEMA, as many pointed out that her earbuds were not even connected to her phone. Many on social media blasted the response of the Biden-Harris administration — or complete lack thereof. Trump also had something to say about it on Sunday, asking on Truth Social, “Why is Lyin’ Kamala Harris in San Francisco, a City that she has totally destroyed, at fundraising events, when big parts of our Country are devastated and under water — with many people dead?” WATCH — Aftermath: Aerial Footage Seen of Tampa Area After Hurricane Helene Passed Through: Many have been making comparisons to the train derailment that affected East Palestine, Ohio, as it was Trump who arrived before the Biden administration, comforting residents and bringing them supplies. WATCH BELOW CLASS ACT — Donald Trump Visits with Americans at East Palestine McDonalds, Fact-Checkers Go BESERK:\nVideo Source: Alana Mastrangelo / Breitbart News Trump to East Palestine Residents: “You Are Not Forgotten”:\nVideo Source: Alana Mastrangelo / Breitbart News “Thank You for Not Forgetting About Us!” East Palestine Residents Cheer Trump’s Visit: Donald Trump Delivers Water Bottles to East Palestine:\nVideo Source: Obtained by Breitbart News",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Donald Trump",
        "Georgia",
        "hurricane",
        "Hurricane Helene",
        "Kamala Harris",
        "Trump",
        "lots",
        "relief",
        "material",
        "victims",
        "jwplayer",
        "people",
        "Palestine",
        "East"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/investigators-department-veterans-affairs-staffers-improperly-accessed-vance-walzs-medical-records/",
      "title": "Investigators: Department of Veterans Affairs Staffers ‘Improperly Accessed’ Vance and Walz’s Medical Records",
      "author": "Amy Furr",
      "content": "Department of Veterans Affairs (VA) workers are accused of improperly accessing medical records belonging to vice-presidential nominees Sen. JD Vance (R-OH) and Gov. Tim Walz (D-MN). Investigators say at least a dozen employees “improperly accessed” the records over the summer, an alleged move that would violate federal health privacy laws, the Washington Post reported Monday. The outlet continued: VA officials notified the Vance and Walz campaigns about the breaches after discovering the unauthorized viewing by employees at the agency’s massive health care arm, the Veterans Health Administration, according to people familiar with the investigation who spoke on the condition of anonymity to describe the ongoing investigation. Now, investigators are trying to determine if the records were shared as they probe the motives behind the alleged breach. “Some employees told investigators that they were simply curious to see Walz and Vance’s medical records, as both nominees’ military service has faced scrutiny during the presidential campaign,” the Post article read. WATCH — Maher on Walz Saying He Carried Weapons in War: Walz Is “a Huge Liar Like All Politicians Are”: In August, Vance, who is a U.S. Marine veteran, criticized Walz for lying about his military service, according to Breitbart News. The article said Vance highlighted the fact that “Walz — a retired Army National Guard sergeant major — not only dropped out of the Army before his unit deployed to Iraq, but has lied about his military service, claiming that he carried weapons ‘in war’ — when he never served in combat or war.” The Minnesota National Guard has since revealed that Walz had his rank reduced to master sergeant the day before he retired, “which means that he never retired as a command sergeant major as he has claimed numerous times in political ads and in political settings,” Breitbart News reported on August 17. Vance and Walz are scheduled to debate on Tuesday as the 2024 presidential election intensifies and as Americans get ready to vote in November, the Associated Press (AP) reported on Sunday.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "Department of Veterans Affairs",
        "investigation",
        "JD Vance",
        "medical records",
        "Tim Walz",
        "Vance",
        "Walz",
        "Affairs",
        "Veterans",
        "Department",
        "records",
        "employees",
        "service"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/clips/2024/09/30/nprs-hinojosa-latinos-who-support-trump-want-to-be-white/",
      "title": "NPR’s Hinojosa: Latinos Who Support Trump ‘Want to Be White’",
      "author": "Pam Key",
      "content": "NPR host Maria Hinojosa said on this week’s broadcast of MSNBC’s “The Sunday Show” that Latinos who support former President Donald Trump “want to be white.” Host Jonathan Capehart said, “This is from this Telemundo poll, that shows a shrinking majority of Latino voters in favor of the Democratic candidate.” He asked, “Vice President Harris at 54%, she has a 14 point lead but it has been shrinking after each consecutive presidential election from 2016. Why is that? Why is the Democratic share of the Latino vote shrinking?” Hinojosa said, “What I said to you when we asked the question was, Latinos want to be white. They want to be with the cool kids.” She added, “I’m asking Latinos all the time and they just say, ‘Well, isn’t Donald Trump es tan buen negociante? He is such a good businessman.’ It’s like, no, he’s not. He had bankruptcies. But they don’t want to be identified with all of those other immigrants that Donald Trump speaks so badly of, including me as a Mexican immigrant, so they’re like, ‘Let’s be with him.’ Those numbers, they could cost Kamala Harris the election. Everything that I’ve been saying that Latinos could push her over the top, these are the numbers that could also take her down.” Follow Pam Key on X @pamkeyNEN",
      "genre": "clips",
      "date": "30-09-2024",
      "keywords": [
        "2024 Presidential Election",
        "Donald Trump",
        "Kamala Harris",
        "Latin America",
        "Latinos",
        "Trump",
        "support",
        "white",
        "NPR",
        "Hinojosa",
        "shrinking",
        "Donald"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/middle-east/2024/09/30/u-s-airstrikes-kill-37-islamic-state-and-al-qaeda-terrorists-in-syria/",
      "title": "U.S. Airstrikes Kill 37 Islamic State and Al-Qaeda Terrorists in Syria",
      "author": "John Hayward",
      "content": "The U.S. Central Command (CENTCOM) said on Sunday that two targeted airstrikes in Syria eliminated 37 terrorists aligned with the Islamic State and al-Qaeda, including several senior leaders. CENTCOM revealed the first of the previously undisclosed airstrikes was conducted on September 16 on a “remote ISIS training camp in central Syria.” At least 28 ISIS operatives were killed, including four “senior leaders.” “The airstrike will disrupt ISIS’ capability to conduct operations against U.S. interests, as well as our allies and partners,” CENTCOM said. On September 24, a second targeted strike in northwestern Syria killed “nine terrorist operatives” of a group called Hurras al-Din, including a senior leader called Marwan Bassam. “Hurras al-Din is an al-Qaeda-affiliated organization based in Syria with global aspirations to conduct attacks against U.S. and Western interests,” CENTCOM explained. Hurras al-Din is the successor to the infamous Nusrah Front as the leading al-Qaeda franchise in Syria. The Nusrah Front broke away from al-Qaeda’s control in 2018, absorbing several smaller Syrian rebel militias that were reluctant to join al-Qaeda and renaming itself Hay’at Tahrir al-Sham (HTS). Hardcore al-Qaeda loyalists in the Nusrah Front created a new group called Hurras al-Din, which found itself struggling to survive against Western counter-terrorist operations, the Syrian government, and HTS, which decided to eliminate any threat posed by its former Nusrah Front comrades. HTS and Hurras al-Din members have been known to abduct and kill each other over the past six years as they struggle for influence and resources. In August, the U.S. military eliminated Hurras al-Din leader Abu-Abd al-Rahman al-Makki with a “targeted kinetic strike” in Syria. Al-Makki was the operational commander of the group’s terrorist activities in Syria. CENTCOM’s statement on Sunday said there was “no indication any civilians were harmed” in either the September 16 or September 24 strikes.",
      "genre": "middle-east",
      "date": "30-09-2024",
      "keywords": [
        "airstrikes",
        "al-Qaeda",
        "ISIS",
        "Islamic State",
        "Syria",
        "U.S. Central Command (CENTCOM)",
        "Islamic",
        "Qaeda",
        "terrorists",
        "Hurras",
        "Din",
        "CENTCOM"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/sports/2024/09/30/video-crowd-cheers-as-caitlin-clark-appears-on-jumbotron-at-colts-steelers-game/",
      "title": "VIDEO: Crowd Cheers as Caitlin Clark Appears on Jumbotron at Colts-Steelers Game",
      "author": "Dylan Gwinn",
      "content": "It has been nearly a week since Caitlin Clark’s season ended, only two games into the WNBA playoffs. However, she’s still getting cheered. On Sunday, the WNBA superstar appeared on the jumbotron at the Colts-Steelers game in Indianapolis during a feature called, Who ya Got? In which fans are asked to side with the “haters” or another hometown favorite. The crowd then cheers or boos according to their preferences. Unsurprisingly, when Caitlin Clark was featured, the crowd made their preference well known. Caitlin Clark gaining instant recognition on a jumbotron—even if it’s in the city she plays in—is an achievement that deserves recognition. The number of WNBA players in history who have instant facial recognition by fans without prompting is extremely small. Her rookie season, however, raised not only her own profile but also that of a league that had previously been little more than an afterthought in the minds of American sports fans. Clark eclipsed records for the most points scored by a rookie in WNBA history, the all-time scoring record for a point guard, the new mark for most assists in a single game, the record for most assists in a single season by any WNBA player, and the rookie record for the number of triple-doubles in a season. She also passed Diana Taurasi for second place for the most made three-pointers by any player in a season. And that’s not even mentioning her impact on team and league merchandising, attendance, and viewership. The Colts beat the Steelers 27-24.",
      "genre": "sports",
      "date": "30-09-2024",
      "keywords": [
        "Caitlin Clark",
        "Indianapolis Colts",
        "NFL",
        "Pittsburgh Steelers",
        "WNBA",
        "Caitlin",
        "Clark",
        "playoffs",
        "games",
        "season",
        "record",
        "rookie"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/europe/2024/09/30/russia-strikes-11-ukrainian-regions-overnight-with-record-breaking-drone-waves/",
      "title": "Russia Strikes 11 Ukrainian Regions Overnight With Record-Breaking Drone Waves",
      "author": "Breitbart London",
      "content": "KYIV, Ukraine (AP) – Russia fired missiles and drones at 11 regions of Ukraine, the Ukrainian air force said Monday, in a 33rd consecutive night of aerial attacks behind the front line and set a new monthly record of drone barrages. In Kyiv, multiple explosions and machine gun fire could be heard throughout the night as the Ukrainian capital´s air defenses fought off a drone attack for five hours. No casualties were reported in Kyiv or elsewhere, though a “critical infrastructure object” caught fire in the southern Mykolaiv region, Gov. Vitalii Kim said, without elaborating. Russia has increasingly deployed Shahed drones, rather than more expensive missiles, in its aerial bombardment of Ukrainian cities since its full-scale invasion of its neighbor in February 2022. It launched more than 1,300 Shahed drones at Ukraine in September alone – the highest number of drone attacks in a single month since the war began. Ukraine, too, has developed a new generation of drones for the battlefield and for long-range strikes deep inside Russia. More than 100 Ukrainian drones were shot down over Russia on Sunday, Russian officials said. Also Monday, Russian President Vladimir Putin released a video marking the second anniversary of the annexation of four Ukrainian territories and again accused the West of turning Ukraine into “a military base aimed at Russia.” Putin was speaking to mark the annexation of the Donetsk, Luhansk, Kherson and Zaporizhzhia regions of Ukraine after a referendum held in 2022 which was denounced by the West as a sham. Russia also illegally annexed Crimea in 2014. Since 2022, Putin said, businesses in the occupied areas are being “actively restored” and hospitals and schools are being rebuilt. Thousands of Ukrainians fled from the four regions as a result of Russia´s invasion, but Putin said Russia´s military operation in the country was to defend residents´ “well-being” and the “future for our children and grandchildren.”",
      "genre": "europe",
      "date": "30-09-2024",
      "keywords": [
        "drone strikes",
        "drones",
        "Russia",
        "Ukraine",
        "Ukraine war",
        "Record",
        "month",
        "single",
        "Ukrainian",
        "Putin"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/health/2024/09/30/gavin-newsom-signs-bill-requiring-health-insurance-to-cover-ivf/",
      "title": "Gavin Newsom Signs Bill Requiring Health Insurance to Cover IVF",
      "author": "Joel B. Pollak",
      "content": "California Gov. Gavin Newsom (D) signed a bill Sunday requiring major health insurance companies in the state to cover in vitro fertilization (IVF), a move that was deliberately aimed at affecting the national presidential election. IVF is an experimental treatment once used in rare cases to help couples struggling with infertility. It has now become more popular as an option for women who want to delay pregnancy, or raise children on their own. It is, however, very expensive. Few insurance policies cover IVF, due to the cost, though there is ample anecdotal evidence of women taking short-term jobs at the few companies, like Amazon.com, that offer to cover IVF as part of benefit packages. The bill, SB 729, “would require large and small group health care service plan contracts and disability insurance policies issued, amended, or renewed on or after July 1, 2025, to provide coverage for the diagnosis and treatment of infertility and fertility services. With respect to large group health care service plan contracts and disability insurance policies, the bill would require coverage for a maximum of 3 completed oocyte retrievals, as specified. The bill would revise the definition of infertility, and would remove the exclusion of in vitro fertilization from coverage.” The bill also requires the state to compensate local governments and school districts for the new costs it imposes; it does not make any determination about what to do if IVF coverage makes health insurance more costly in the private sector. In a statement, Newsom said: “California is a proud reproductive freedom state – and that includes increasing access to fertility services that help those who want to start a family. As Republicans across the country continue to claw back rights and block access to IVF – all while calling themselves ‘the party of families’ – we are proud to help every Californian make their own choices about the family they want.” He did not provide evidence for his claims. President Donald Trump has said, often, that he supports IVF. Democrats claim that Republicans want to end IVF. They cited a controversy in Alabama, where many health care providers suspended IVF treatments after the state’s highest court ruled that IVF embryos were human beings for the purposes of a wrongful death civil lawsuit. Some conservatives have raised ethical questions about what happens to embryos that are frozen or destroyed without developing into human beings. And Trump’s running mate, Sen. JD Vance (R-OH), has expressed support for the traditional family model of raising children. However, there is no Republican effort to block access to IVF. Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
      "genre": "health",
      "date": "30-09-2024",
      "keywords": [
        "California",
        "Gavin Newsom",
        "IVF",
        "Gavin",
        "bill",
        "requiring",
        "health",
        "insurance",
        "coverage"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/biden-snaps-reporter-asking-why-he-vp-harris-were-not-commanding-hurricane-helene-response/",
      "title": "WATCH — Joe Biden Snaps at Reporter Asking Why He &amp; Kamala Weren’t in D.C. for Hurricane Response: ‘It’s Called a Telephone’",
      "author": "Kristina Wong",
      "content": "President Joe Biden on Monday gave a snarky response to a reporter asking why he and Vice President Kamala Harris were not physically in Washington commanding over the federal government’s response to Hurricane Helene, which killed at least 100 people over the weekend across the nation’s southeast. A reporter asked Biden, “On the hurricane, Mr. President, why weren’t you and Vice President Harris here in Washington commanding this this weekend?” Biden snapped at the reporter, “I was commanding, I was on the phone for at least two hours yesterday and the day before as well. I command. It’s called a telephone.” Biden returned Sunday afternoon to Washington after spending the weekend at his beach house in Rehoboth Beach, Delaware. Meanwhile, Vice President Kamala Harris spent the weekend on the West Coast at fundraisers in San Francisco, Los Angeles, and Las Vegas. Follow Breitbart News’s Kristina Wong on “X”, Truth Social, or on Facebook.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "hurricane",
        "Hurricane Helene",
        "Joe Biden",
        "Kamala Harris",
        "response",
        "President",
        "Kamala",
        "Joe",
        "weekend",
        "Biden",
        "Vice",
        "commanding",
        "reporter"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/politics/2024/09/30/exclusive-mike-rogers-to-michigan-factory-workers-democrats-have-just-about-slit-your-throat-and-threw-you-ditch/",
      "title": "Exclusive — Mike Rogers to Michigan Factory Workers: ‘Democrats Have Just About Slit Your Throat and Threw You on the Ditch’",
      "author": "Hannah Knudsen",
      "content": "Democrats have “just bout slit your throat” and “threw you on the ditch,” Republican Michigan Senate candidate Mike Rogers said during an appearance on Breitbart News Daily, discussing the impact Democrat policies have had on factory workers in the state. Host Mike Slater mentioned an MSNBC union town hall featuring union members, noting that half of them said they were not even paying attention to the presidential election. However, there were still a few supporters of Vice President Kamala Harris, so Slater asked the GOP hopeful, “How do you talk to the union guy who’s voting for Kamala?” Rogers said it is clear that union leadership is pushing the Democrat Party line, but the issue is that agenda will “put out some 400,000 Michigan manufacturing workers if they get what they want, which is all the full implementation of their EV mandates.” “It’s been devastating — 2,400 layoffs from Stellantis already. One thousands layoffs from General Motors already. The fact that Ford has announced they’re not going to go into these two SUV all-electric vehicles. So shutting those lines down, they just charged off five billion dollars in losses in their EV unit, which tells you it ain’t working,” Rogers said, noting that the Democrat politicians and bureaucrats in D.C. have forgotten one thing: “Customers.” “People just don’t want to buy them,” he said. Despite that, Democrats are doubling down. “Just about last week, all the Democrats voted — including my opponent, by the way, who’s from Michigan, who also said it’s okay to ban gas engines — to continue the EV mandate,” Rogers said. “There was a chance to stop it. And she said no. I just don’t get it. If you’re in a union shop, if you’re in a non-union shop and you’re working in a factory in Michigan, the Democrats have just about slit your throat and threw you on the ditch,” he said. LISTEN: “They’ve raised your energy prices at work. They’ve raised your energy prices for you to get to work, and when you get home, they’ve raised your energy prices there, which has increased your cost of everything that you buy — eggs and milk and bread. And now they’re saying, guess what? We’re going to send 85 percent of all the processing that happens in an electric vehicle that we’re going to mandate you buy —  [it] has to happen in China. I don’t know anyone who thinks that this is a good idea, other than the Democrats in Washington, DC,” he said. “So yeah, I don’t get it either,” he added. Breitbart News Daily airs on SiriusXM Patriot 125 from 6:00 a.m. to 9:00 a.m. Eastern.",
      "genre": "politics",
      "date": "30-09-2024",
      "keywords": [
        "auto workers",
        "Breitbart News Daily",
        "exclusive",
        "Michigan",
        "Mike Rogers",
        "On the Hill",
        "factory",
        "workers",
        "Rogers",
        "Mike",
        "union",
        "Democrats",
        "don"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/2024-election/2024/09/30/trump-campaign-expects-tim-walz-chameleon-vp-debate/",
      "title": "Trump Campaign Expects Tim Walz to ‘Be a Chameleon’ During VP Debate",
      "author": "Nick Gilbertson",
      "content": "Democrat Vice presidential nominee Gov. Tim Walz (D-MN) will try to avoid discussing his and Vice President Kamala Harris’s “horrific radical left policies” during the vice presidential debate and instead work to paint “rosy pictures” of a future under Harris, according to the Trump campaign. Senior Trump campaign adviser Jason Miller previewed Tuesday’s debate between Walz and Republican vice presidential nominee Sen. JD Vance (R-OH) during a press call with House Majority Whip Tom Emmer (R-MN). Ret. Command Sergeant Major Tom Behrends and Ret. Sergeant First Class Tom Schilling, who served in the Minnesota National Guard with Walz, were also on the call and chronicled how Walz retired after learning of an upcoming deployment to Iraq, effectively dodging the war. When asked if he thinks Walz, who has implemented radical policies in Minnesota and faces accusations of stolen valor, will work to keep the heat on himself to distract from Vice President Kamala Harris’s record, Miller said that Walz is skilled in deflecting. “Tim Walz has a challenge. I mean, he’s very good at this, as we’ve heard from Congressman Emmer and the other gentlemen who both served our country and from Minnesota, Tom Behrends and Tom Schilling,” Miller said. “Where I expect that Tim Walz is going to go is to try to kind of paint this Pollyanna picture of how great things will be under Kamala Harris,” he continued. “And I think you’re going to see Tim Walz avoid things such as their desire to ban fracking, their desire to ban gas-powered automobiles … their desire to grant amnesty to the … twenty-plus million illegal aliens that are in our country.” Miller expects Walz to “be a chameleon” on the debate stage. “As Congressman Emmer said, he’ll paint these rosy pictures of how great things are going to be, and he’ll be a chameleon,” Miller emphasized. “He’s not going to actually lay out these horrific radical left policies that both he and Kamala Harris share.” “But at a certain point here, it’s going to be tough for Tim Walz,” he added. “He’s gonna have to make a business decision up on that stage. Does he go and actually defend some of these crazy things that Kamala Harris wants to put in place, or does he just pretend that the question wasn’t asked and try to pivot to, again, one of his platitudes that we usually hear from him?” Earlier in the call, Miller predicted that Walz will portray himself differently from the “wildly gesticulating effeminate caricature” he presents at rallies. “He’ll be very well prepared for tomorrow night. He’s not going to be the wildly gesticulating effeminate caricature we see at rallies pointing to Kamala Harris dancing about on the stage. Walz is going to be buttoned-up,” Miller said, adding he will be prepared to “lie on command.” RELATED — Tom Emmer: Walz Is a Complete Disaster in Minnesota; the Folksy Guy Is an Act",
      "genre": "2024-election",
      "date": "30-09-2024",
      "keywords": [
        "debate",
        "Jason Miller",
        "JD Vance",
        "Tim Walz",
        "vice presidential debate",
        "presidential",
        "Walz",
        "campaign",
        "Vice",
        "Harris",
        "Miller",
        "Kamala",
        "Tom"
      ],
      "source": "Breitbart News Network"
    },
    {
      "url": "https://www.breitbart.com/2024-election/2024/09/30/gallup-80-key-measures-favor-republicans-2024-election/",
      "title": "Gallup: 80% of Key Measures Favor Republicans in 2024 Election",
      "author": "Wendell Husebo",
      "content": "Eight out of ten key measures in the 2024 presidential election cycle favor Republicans, Gallup polling found Monday. The finding suggests Republicans have a significant chance of holding the House and retaking the Senate, along with the White House. WATCH — Lindsey Graham: Kamala Harris Policies Are “Batsh-t Crazy”: Gallup measured and weighed 10 aspects of the election environment with eight of ten favoring Republicans. Two of the ten measurements that Gallup weighted as “strong” both leaned toward Republicans.\nNone favored or leaned toward Democrats, and two favored neither party. Gallup weighed the measurements that favored neither party as only “weak” and “moderate.” Decision Desk HQ predicts Republicans have a 54 percent chance of keeping control of the House chamber, which is charged with initiating revenue bills, impeaching judges and presidents, and electing a president absent an outright Electoral College victory. In the Senate, Republicans have a 70 percent chance of retaking control, according to the forecast. The Senate is important because it has the exclusive power to confirm presidential appointments, approve or reject treaties, and try cases of impeachment. WATCH — Van Jones: Trump Has “a Good Point” that Biden-Harris Didn’t Take Border “Seriously Enough”: One reason Republicans have a greater chance of flipping the Senate than keeping the House is due to the 2024 electoral map. Democrats have more swing-state seats up for reelection than Republicans. More vulnerable Democrat seats mean the party must spend more resources defending seats rather than attacking seats held by Republican senators up for reelection. A second reason Republicans have a lower chance of keeping the House is due to a reduced amount of total battleground districts up for grabs, placing greater weight on fewer races. Population shifts among partisans and subsequent redistricting within those states spawned the overall reduced number of swing districts, political experts believe. Wendell Husebo is a political reporter with Breitbart News and a former RNC War Room Analyst. He is the author of Politics of Slave Morality. Follow Wendell on “X” @WendellHusebø or on Truth Social @WendellHusebo.",
      "genre": "2024-election",
      "date": "30-09-2024",
      "keywords": [
        "Congress",
        "Donald Trump",
        "Kamala Harris",
        "measures",
        "favor",
        "election",
        "Gallup",
        "key",
        "Republicans",
        "House",
        "Party",
        "chance",
        "seats"
      ],
      "source": "Breitbart News Network"
    }
]